# With love by Vyacheslav Davydov |   ( • ) ( • )   | v.davydov@qsoft.ru  - enjoy that beautiful day :)
.ONESHELL:
MAKEFLAGS += --no-print-directory
c=null
export c
.DEFAULT_GOAL := help



LARAVEL_SERVICES = \
	attribute-service \
	a-plus-service \
	cart-service \
	feed-service \
	idm-service \
	master-service \
	media-service \
	mobile-service \
	mindbox-service \
	notification-service \
	order-service \
	retail-service \
	saga-service \
	search-service \
	site-service \
	user-service \
	wms-service

GO_SERVICES = \
	api-gateway \
	clickhouse-analytics-service \
	import-service \
	stock-service

NODE_SERVICES = \
	front-service \
	redirect-service

PACKAGES = \
	event-dispatcher-package \
	firebase-client-package \
	foundation-package \
	mindbox-sdk-package \
	mindbox-service-client-package \
	redis-ref-cleaner-package \
	service-dto-package \
	stock-service-client-package \
	user-service-client-package

DATABASES = \
	attribute_data \
	cart_data \
	feed_data \
	idm_data \
	master_data \
	media_data \
	media_data_test \
	mindbox_data \
	mobile_data \
	notification_data \
	order_data \
	redirect_data \
	retail_data \
	saga_data \
	search_data \
	stock_data \
	site_data \
	site_data_test \
	user_data \
	wms_data


build:
	@echo '\n============================================================'
	@echo '---------------- Building containers------------------------'
	@echo '============================================================\n'

	docker load < ./_/docker_images/alpine-3.16.0.tar
	docker load < ./_/docker_images/bitnami-clickhouse-24.4.1.tar
	docker load < ./_/docker_images/elasticsearch-7.17.1.tar
	docker load < ./_/docker_images/golang-1.18-alpine.tar
	docker load < ./_/docker_images/minio-RELEASE.2024-05-07T06-41-25Z.fips.tar
	docker load < ./_/docker_images/mongo-7.0.9.tar
	docker load < ./_/docker_images/postgres-16.2.tar
	docker load < ./_/docker_images/rabbitmq:3.11.2-management.tar
	docker load < ./_/docker_images/redis:7.2.4.tar
	docker load < ./_/docker_images/ubuntu-bionic.tar
	docker load < ./_/docker_images/ubuntu-jammy.tar
	docker load < ./_/docker_images/unit-php.tar
	docker load < ./_/docker_images/bitnami-redis-cluster-7.2.4.tar
	docker load < ./_/docker_images/willfarrell-autoheal-1.2.0.tar
	docker load < ./_/docker_images/node-16.15.1.tar
	docker load < ./_/docker_images/node-20-slim.tar
	docker load < ./_/docker_images/node-18-slim.tar
	docker load < ./_/docker_images/kibana-7.17.1.tar


ifeq ($(c),null)
	docker compose build
endif
ifneq ($(c),null)
	docker compose build $(c)
endif


rebuild:
	@$(MAKE) stop
	@$(MAKE) build
	@$(MAKE) start


start:
ifeq ($(c),import-prepare)
	@echo '\n============================================================'
	@echo '----- Error! Use make import-prepare command instead! ------'
	@echo '============================================================\n'
else ifeq ($(c),import-deploy)
	@echo '\n============================================================'
	@echo '----- Error! Use make import-deploy command instead! ------'
	@echo '============================================================\n'
else
	@echo '\n============================================================'
	@echo '---------------- Starting containers------------------------'
	@echo '============================================================\n'

	mkdir -p ./_/data/elasticsearch
	mkdir -p ./_/data/clickhouse
	$(MAKE) clear-logs
ifeq ($(c),null)
	docker compose up -d --remove-orphans --wait
endif
ifneq ($(c),null)
	docker compose up -d $(c) --remove-orphans --wait
endif
endif
# docker compose up -d $(c) --remove-orphans --force-recreate --always-recreate-deps --wait


stop:
	@echo '\n============================================================'
	@echo '---------------- Stopping containers------------------------'
	@echo '============================================================\n'
ifeq ($(c),null)
	docker compose down
endif
ifneq ($(c),null)
	docker compose down $(c)
endif


restart: stop start


start-laravel-services:
	$(MAKE) start c='$(LARAVEL_SERVICES)'



stop-laravel-services:
	$(MAKE) stop c='$(LARAVEL_SERVICES)'



restart-laravel-services: stop-laravel-services start-laravel-services



start-go-services:
	@for s in $(GO_SERVICES); do \
		$(MAKE) start c=$$s
	done


stop-go-services:
	@for s in $(GO_SERVICES); do \
		$(MAKE) stop c=$$s
	done


restart-go-services: stop-go-services start-go-services


restart-front-services: stop-front-services start-front-services


start-backend:
	$(MAKE) start-laravel-services
	$(MAKE) start-go-services
	$(MAKE) start c=redirect-service

stop-backend:
	$(MAKE) stop-laravel-services
	$(MAKE) stop-go-services
	$(MAKE) stop c=redirect-service


restart-backend: stop-backend start-backend


start-frontend:
	$(MAKE) start c=front-service


stop-frontend:
	$(MAKE) stop c=front-service


restart-frontend: stop-frontend start-frontend


refresh:
	@$(MAKE) stop
	@$(MAKE) build
	@$(MAKE) master
	@$(MAKE) composer
# @$(MAKE) composer-no-deps
	@$(MAKE) clear-go-cache
	@$(MAKE) clear-front-cache
	@$(MAKE) start
	@$(MAKE) queues
	@$(MAKE) migrate
	@$(MAKE) db-restore
	@$(MAKE) db-vacuum



init:
	@$(MAKE) stop
	@$(MAKE) build
	@$(MAKE) master
	@$(MAKE) dep-restore
	@$(MAKE) clear-go-cache
	@$(MAKE) clear-front-cache
	@$(MAKE) start
	@$(MAKE) queues
	@$(MAKE) db-restore
	@$(MAKE) db-vacuum



composer:
	@echo '\n============================================================';
	@echo '--------- Installing composer dependencies -----------------';
	@echo '============================================================\n';

ifeq ($(c),null)
	@$(MAKE) start-laravel-services

	@for s in $(LARAVEL_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php /tmp/composer.phar i; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif
ifneq ($(c),null)
	$(MAKE) start

	@for s in $(c); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php /tmp/composer.phar i; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif


# composer-no-deps:
# 	@echo '\n============================================================';
# 	@echo '--------- Installing composer dependencies -----------------';
# 	@echo '============================================================\n';

# 	@for s in $(LARAVEL_SERVICES); do \
# 		echo '\n============================================================'; \
# 		echo '----------- '$$s' -----------';\
# 		echo '============================================================\n'; \

# 		docker compose up -d $$s --no-deps
# 		docker exec -it $$s php /tmp/composer.phar i; \
# 		$(MAKE) stop c=$$s
# 	done

# 	@echo '\n============================================================';
# 	@echo '------------------------ Success! --------------------------';
# 	@echo '============================================================\n';


migrate:
	@echo '\n============================================================';
	@echo '---------------- Running migrations ------------------------';
	@echo '============================================================\n';

ifeq ($(c),null)
	@$(MAKE) start-laravel-services;

	@for s in $(LARAVEL_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php artisan migrate --force; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif
ifneq ($(c),null)
	$(MAKE) start

	@for s in $(c); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php artisan migrate --force; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif


optimize:
	@echo '\n============================================================';
	@echo '------------- Optimizing Laravel services ------------------';
	@echo '============================================================\n';

ifeq ($(c),null)
	@$(MAKE) start-laravel-services

	@for s in $(LARAVEL_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php artisan optimize:clear; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif
ifneq ($(c),null)
	$(MAKE) start

	@for s in $(c); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php artisan optimize:clear; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif


queues:
	@echo '\n============================================================';
	@echo '------------------ Binding queues --------------------------';
	@echo '============================================================\n';
ifeq ($(c),null)
	@$(MAKE) start-laravel-services

	@for s in $(LARAVEL_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php artisan event-dispatcher:queue-binding --quorum=1; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif
ifneq ($(c),null)
	$(MAKE) start

	@for s in $(c); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		docker exec -it $$s php artisan event-dispatcher:queue-binding --quorum=1; \
	done

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';
endif


master:
	@echo '\n============================================================';
	@echo '---------------- Syncing with gitlab------------------------';
	@echo '============================================================\n';

ifeq ($(c),null)
	@cd ./services;

	@for s in $(LARAVEL_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		cd $$s ; \
		git checkout master && git pull origin master ; \
		cd .. ; \
	done
	@for s in $(GO_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		cd $$s ; \
		git checkout master && git pull origin master ; \
		cd .. ; \
	done

	@for s in $(NODE_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		cd $$s ; \
		git checkout master && git pull origin master ; \
		cd .. ; \
	done

	@cd ../packages;
	@for s in $(PACKAGES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		cd $$s ; \
		git checkout master && git pull origin master ; \
		cd .. ; \
	done

	@echo '\n============================================================';
	@echo '----------- 'docs' -----------';
	@echo '============================================================\n';
	@cd ../docs;
	@git checkout master && git pull origin master ;
	@cd .. ;
endif
ifneq ($(c),null)
	@for s in $(c); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		cd $$s ; \
		git checkout master && git pull origin master ; \
		cd - ; \
	done
endif


clear-logs:
	@echo '\n============================================================';
	@echo '-------------------- Clearing logs -------------------------';
	@echo '============================================================\n';

	@for s in $(LARAVEL_SERVICES); do \
		rm -f ./services/$$s/storage/logs/laravel.log; \
		rm -f ./logs/$$s.log; \
		ln -s ../services/$$s/storage/logs/laravel.log ./logs/$$s.log; \
		echo $$s: logs have been successfully cleared
	done


clear-go-cache:
	@echo '\n============================================================';
	@echo '-------------------- Clearing go cache ---------------------';
	@echo '============================================================\n';

	@sudo rm ./_/data/go/import-prepare-cache -rf
	@sudo rm ./_/data/go/import-deploy-cache -rf
	@sudo rm ./_/data/go/stock-service-cache -rf
	@sudo rm ./_/data/go/clickhouse-analytics-service -rf

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';


clear-front-cache:
	@echo '\n============================================================';
	@echo '-------------------- Clearing Nuxt cache ---------------------';
	@echo '============================================================\n';

	$(MAKE) start c=front-service
	docker exec -it front-service npx nuxi cleanup

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';


clear-laravel-cache:
	@echo '\n============================================================';
	@echo '-------------------- Clearing Laravel cache ----------------';
	@echo '============================================================\n';

	@$(MAKE) start c=idm-service
	@docker exec -it idm-service php artisan cache:clear

	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';


import-prepare:
	@docker compose up import-prepare --remove-orphans --wait --scale import-prepare=1


import-deploy:
	@docker compose up import-deploy --remove-orphans --wait --scale import-deploy=1


clear-broken-indexes:
	@docker compose up search-service-broken-indexes-cleaner --remove-orphans --wait --scale search-service-broken-indexes-cleaner=1

kibana:
	@docker compose up kibana --remove-orphans --wait --scale kibana=1

d = null
db-dump:
	@$(MAKE) start c=postgres

ifeq ($(d),null)
	@for db in $(DATABASES); do \
		echo '\n============================================================';
		echo '--------- Backing up '$$db' --------------';
		echo '============================================================\n';

		docker exec -it postgres pg_dump -v -U postgres -d $$db -F tar -f /backups/$$db.tar
	done
endif
ifneq ($(d),null)
	@for db in $(d); do \
		echo '\n============================================================';
		echo '--------- Backing up '$$db' --------------';
		echo '============================================================\n';

		docker exec -it postgres pg_dump -v -U postgres -d $$db -F tar -f /backups/$$db.tar
	done
endif
	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';


db-restore:
	@$(MAKE) start c=postgres

ifeq ($(d),null)
	@for db in $(DATABASES); do \
		echo '\n============================================================';
		echo '--------- Restoring '$$db' --------------';
		echo '============================================================\n';

		docker exec -it postgres pg_restore -v -U postgres -d $$db -F tar /backups/$$db.tar
	done
endif
ifneq ($(d),null)
	@for db in $(d); do \
		echo '\n============================================================';
		echo '--------- Restoring '$$db' --------------';
		echo '============================================================\n';

		docker exec -it postgres pg_restore -v -U postgres -d $$db -F tar /backups/$$db.tar
	done
endif
	@echo '\n============================================================';
	@echo '------------------------ Success! --------------------------';
	@echo '============================================================\n';


db-vacuum:
	@echo '\n============================================================';
	@echo '-------------------- Vacuuming database --------------------';
	@echo '============================================================\n';

	@$(MAKE) start c=postgres

	@for db in $(DATABASES); do \
		docker exec -it postgres psql -U postgres -d $$db -c 'vacuum full verbose'
	done


dep-dump:
	@echo '\n============================================================';
	@echo '--- --------------- Dumping dependencies -------------------';
	@echo '============================================================\n';

	@for s in $(LARAVEL_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		sudo rm ./_/dependencies/$$s -rf; \
		mkdir ./_/dependencies/$$s -p; \
		sudo cp ./services/$$s/vendor/ ./_/dependencies/$$s -r;
	done

	@for s in $(NODE_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		sudo rm ./_/dependencies/$$s -rf; \
		mkdir ./_/dependencies/$$s -p; \
		sudo cp ./services/$$s/node_modules/ ./_/dependencies/$$s -r;
	done

	@for s in $(GO_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		sudo rm ./_/dependencies/$$s -rf; \
		mkdir ./_/dependencies/$$s -p; \
		sudo cp ./_/data/go/$$s-pkg/ ./_/dependencies/$$s -r;
	done


dep-restore:
	@echo '\n============================================================';
	@echo '------------------- Restoring dependencies -----------------';
	@echo '============================================================\n';

	@for s in $(LARAVEL_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		sudo rm ./services/$$s/vendor -r; \
		sudo cp ./_/dependencies/$$s/vendor ./services/$$s -r;
	done

	@for s in $(NODE_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		sudo rm ./services/$$s/node_modules -r; \
		sudo cp ./_/dependencies/$$s/node_modules ./services/$$s -r;
	done

	@for s in $(GO_SERVICES); do \
		echo '\n============================================================'; \
		echo '----------- '$$s' -----------';\
		echo '============================================================\n'; \

		sudo rm ./_/data/go/$$s-pkg/ -r; \
		sudo cp ./_/dependencies/$$s/$$s-pkg ./_/data/go/$$s-pkg -r;
	done



GREEN='\033[1;32m'
WHITE='\033[1;37m'
help:
	@echo ${GREEN}'	'motivation${WHITE}'                                       '—' 'отборные' 'мотивационные' 'цитатки' 'на' 'все' 'случаи' 'жизни;
	@echo ${GREEN}'	'start' '"[c=<service>|c='<service1> <service2>']"${WHITE}'    '—' 'запуск' 'сервиса/сервисов;
	@echo ${GREEN}'	'stop' '"[c=<service>|c='<service1> <service2>']"${WHITE}'     '—' 'остановка' 'сервиса/сервисов;
	@echo ${GREEN}'	'restart' '"[c=<service>|c='<service1> <service2>']"${WHITE}'  '—' 'перезапуск' 'сервиса/сервисов;
	@echo ${GREEN}'	'build' '"[c=<service>|c='<service1> <service2>']"${WHITE}'    '—' 'билд' 'сервиса/сервисов;
	@echo ${GREEN}'	'rebuild' '"[c=<service>|c='<service1> <service2>']"${WHITE}'  '—' 'ребилд' 'сервиса/сервисов' '—' 'стоп,билд,старт;
	@echo ${GREEN}'	'start-laravel-services${WHITE}'                           '—' 'запуск' 'Laravel' 'сервисов;
	@echo ${GREEN}'	'stop-laravel-services${WHITE}'                            '—' 'остановка' 'Laravel' 'сервисов;
	@echo ${GREEN}'	'restart-laravel-services${WHITE}'                         '—' 'перезапуск' 'Laravel' 'сервисов;
	@echo ${GREEN}'	'start-go-services${WHITE}'                                '—' 'запуск' 'Go' 'сервисов;
	@echo ${GREEN}'	'stop-go-services${WHITE}'                                 '—' 'остановка' 'Go' 'сервисов;
	@echo ${GREEN}'	'restart-go-services${WHITE}'                              '—' 'перезапуск' 'Go' 'сервисов;
	@echo ${GREEN}'	'start-backend${WHITE}'                                    '—' 'запуск' 'бэка;
	@echo ${GREEN}'	'stop-backend${WHITE}'                                     '—' 'остановка' 'бэка;
	@echo ${GREEN}'	'restart-backend${WHITE}'                                  '—' 'перезапуск' 'бэка;
	@echo ${GREEN}'	'start-frontend${WHITE}'                                   '—' 'запуск' 'фронта;
	@echo ${GREEN}'	'stop-frontend${WHITE}'                                    '—' 'остановка' 'фронта;
	@echo ${GREEN}'	'restart-frontend${WHITE}'                                 '—' 'перезапуск' 'фронта;
	@echo ${GREEN}'	'init${WHITE}'                                             '—' 'первая' 'инициализация' 'проекта;
	@echo ${GREEN}'	'refresh${WHITE}'                                          '—' 'переустановка' 'проекта' 'с' 'чистого' 'листа;
	@echo ${GREEN}'	'composer' '"[c=<service>|c='<service1> <service2>']"${WHITE}' '—' 'установка' 'composer' 'зависимостей' 'в' 'Laravel' 'сервисе/сервисах;
	@echo ${GREEN}'	'migrate' '"[c=<service>|c='<service1> <service2>']"${WHITE}'  '—' 'проведение' 'миграций' 'в' 'Laravel' 'сервисе/сервисах;
	@echo ${GREEN}'	'optimize' '"[c=<service>|c='<service1> <service2>']"${WHITE}' '—' 'сброс' 'оптимизации' '\(php' 'artisan' 'optimize:clear\)' 'в' 'Laravel' 'сервисе/сервисах;
	@echo ${GREEN}'	'queues' '"[c=<service>|c='<service1> <service2>']"${WHITE}'   '—' 'привязка' 'очередей' 'в' 'Laravel' 'сервисе/сервисах;
	@echo ${GREEN}'	'master' '"[c=<service>|c='<service1> <service2>']"${WHITE}'   '—' 'переключение' 'на' 'ветку' 'master' 'и' 'получение' 'изменений' 'из' 'удалённого' 'репозитория;
	@echo ${GREEN}'	'clear-logs${WHITE}'                                       '—' 'очистка' 'логов' 'в' 'Laravel' 'сервисе/сервисах;
	@echo ${GREEN}'	'clear-go-cache${WHITE}'                                   '—' 'очистка' 'Go' 'кэша,' 'используемого' 'при' 'билде' 'приложений;
	@echo ${GREEN}'	'clear-front-cache${WHITE}'                                '—' 'очистка' 'Nuxt' 'кэша;
	@echo ${GREEN}'	'clear-laravel-cache${WHITE}'                              '—' 'очистка' 'пользовательского' 'кэша' 'ВО' 'ВСЕХ' 'Laravel' 'сервисах' '\(php' 'artisan' 'cache:clear\);
	@echo ${GREEN}'	'clear-broken-indexes${WHITE}'                             '—' 'очистка' 'индексов' 'без' 'алиаса' 'в' 'эластике;
	@echo ${GREEN}'	'import-prepare${WHITE}'                                   '—' 'выполнение' 'этапа' 'prepare' 'в' 'импорте;
	@echo ${GREEN}'	'import-deploy${WHITE}'                                    '—' 'выполнение' 'этапа' 'deploy' 'в' 'импорте;
	@echo ${GREEN}'	'kibana${WHITE}'                                           '—' 'запуск' 'кибаны;
	@echo ${GREEN}'	'db-dump' '"[d=<db>|d='<db1> <db2>']"${WHITE}'                 '—' 'формирование' 'дампа' 'БД;
	@echo ${GREEN}'	'db-restore' '"[d=<db>|d='<db1> <db2>']"${WHITE}'              '—' 'восстановление' 'БД' 'из' 'дампа;
	@echo ${GREEN}'	'db-vacuum${WHITE}'                                        '—' 'высвобождение' 'свободного' 'места' 'на' 'диске;
	@echo ${GREEN}'	'dep-dump${WHITE}'                                         '—' 'формирование' 'дампа' 'зависимостей' 'сервисов;
	@echo ${GREEN}'	'dep-restore${WHITE}'                                      '—' 'восстановление' 'дампа' 'зависимостей' 'сервисов;
# help:
# 	@grep -E '^[a-zA-Z0-9_-]+:.*?## .*$$' $(MAKEFILE_LIST) \
# 	| sed -n 's/^\(.*\): \(.*\)##\(.*\)/\1\3/p' \
# 	| column -t  -s ''

AUTHORS = \
	Вячеслав' 'Давыдов \
	Вячеслав' 'Давыдов \
	Вероника' 'Молчанова \
	Вероника' 'Молчанова \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	Тайлер' 'Дёрден \
	'' \
	Фрэнк' 'Заппа \
	'' \
	Джон' 'Уэйн \
	'' \
	Мэй' 'Уэст \
	'' \
	Джеффри' 'Гитомер \
	Альберт' 'Эйнштейн \
	'' \
	'' \
	'' \
	Билл' 'Коупленд \
	'' \
	Джордж' 'Карлин \
	'' \
	Стив' 'Мартин \
	'' \
	Дэйв' 'Барри \
	'' \
	'' \
	Наполеон' 'Хилл \
	Стивен' 'Райт \
	Зиг' 'Зиглар \
	'' \
	Вуди' 'Аллен \
	Билл' 'Мюррей \
	Джек' 'Лондон \
	Кайл' 'Чендлер \
	Трумен' 'Капоте \
	Робин' 'Уильямс \
	Роберт' 'Блох \
	'' \
	Айзек' 'Азимов \
	Donald' 'Trump \
	Стивен' 'Райт \
	Мария' 'Осмонд \
	Чарльз' 'Шульц \
	Том' 'Лерер \
	'' \
	'' \
	Томас' 'Эдисон \
	Ричард' 'Бах \
	'' \
	Лорел' 'Тэтчер' 'Ульрих \
	'' \
	Сидни' 'Харрис \
	Йоги' 'Берра \
	Фред' 'Аллен \
	'' \
	Ральф' 'Уолдо' 'Эмерсон \
	Марк' 'Твен \
	Элис' 'Рузвельт' 'Лонгворт \
	'' \
	Роберт' 'Бенчли \
	Франклин' 'П.' 'Джонс \
	'' \
	Сэм' 'Левенсон \
	Эллен' 'Дедженерес \
	Лэнгстон' 'Коулман \
	Марк' 'Твен \
	Марк' 'Твен \
	Зиг' 'Зиглар \
	'' \
	'' \
	Доктор' 'Сьюз \
	Лиза' 'Либерман-Ванг \
	Гарри' 'Эмерсон' 'Фосдик \
	'' \
	Robert' 'Downey' 'Jr. \
	Оскар' 'Уайльд \
	'' \
	'' \
	Сэм' 'Левенсон \
	'' \
	'' \
	'' \
	Гручо' 'Маркс \
	'' \
	Джош' 'Биллингс \
	А.А.' 'Милн \
	'' \
	Луис' 'Си' 'Кей \
	Лиза' 'Либерман-Ванг \
	Мартина' 'Навратилова \
	Наруто' 'Узумаки \
	'' \
	'' \
	Лили' 'Томлин \
	'' \
	Уилл' 'Роджерс \
	Артур' 'Баер \
	Роберт' 'Фрост \
	Мари' 'фон' 'Эбнер-Эшенбах \
	'' \
	Элберт' 'Хаббард \
	'' \
	'' \
	Марк' 'Твен \
	'' \
	'' \
	Уилл' 'Роджерс \
	'' \
	Барни' 'Стинсон \
	Оскар' 'Уайльд \
	Дэнни' 'Кей \
	Дуайт' 'Д.' 'Эйзенхауэр \
	Терри' 'Пратчетт \
	'' \
	Роджер' 'Стаубах \
	'' \
	Эшли' 'Бриллиант \
	Далай' 'Лама \
	'' \
	Одри' 'Хепберн \
	Бенджамин' 'Франклин \
	'' \
	'' \
	Эллис' 'Видлер \
	Стивен' 'Райт \
	Майкл' 'Скотт \
	'' \
	'' \
	Вольтер \
	Билл' 'Уоттерсон \
	'' \
	'' \
	Этель' 'Бэрримор \
	Ханс' 'Ф.' 'Хансен \
	Лиза' 'Либерман-Ванг \
	'' \
	'' \
	Эдгар' 'Аллан' 'По \
	Рон' 'Уайт \
	'' \
	'' \
	Джон' 'Леннон \
	Джон' 'Грин \
	Брайан' 'Васцили \
	'' \
	'' \
	Чарльз' 'Дж.' 'Сайкс \
	'' \
	Кассандра' 'Даффи \
	Бастер' 'Гуру \
	'' \
	Джордж' 'Карлин \
	'' \
	'' \
	Марк' 'Твен \
	Реба' 'МакЭнтир \
	Терри' 'Пратчетт \
	'' \
	Мишель' 'Руиз \
	Герм' 'Олбрайт \
	Роберт' 'Браулт \
	'' \
	'' \
	Доктор' 'Сьюз \
	'' \
	'' \
	'' \
	Пьер' 'Депрож \
	'' \
	Dolly' 'Parton \
	Dolly' 'Parton \
	Стив' 'Мараболи \
	Вуди' 'Аллен \
	'' \
	'' \
	'' \
	'' \
	Юджин' 'Белл-младший \
	'' \
	'' \
	Рональд' 'Рейган \
	Генри' 'Уодсворт' 'Лонгфелло \
	Бернард' 'Барух \
	Соломон' 'Шехтер \
	Бертран' 'Рассел \
	Энди' 'Руни \
	Билл' 'Уоттерсон \
	Джеймс' 'Джейсон \
	Брайан' 'Уайт \
	Мартин' 'Медоуз \
	Стивен' 'Райт \
	Томас' 'Абреу \
	Малкольм' 'Форбс \
	Морин' 'Дауд \
	Фрэнк' 'Заппа \
	Вольтер \
	Элеонора' 'Рузвельт \
	Джордж' 'Бернард' 'Шоу \
	Джеймс' 'Тёрбер \
	Билли' 'Уайлдер \
	Чарльз' 'Уодсворт \
	Джеффри' 'Стар \
	У.' 'Х.' 'Оден \
	Шарль' 'де' 'Голль \
	Томас' 'Соуэлл \
	Дороти' 'Паркер \
	Джордж' 'Бернс \
	Drake \
	Роберт' 'Фрос \
	Алан' 'Дандес \
	Джордж' 'Карлин \
	Франсуа' 'де' 'Ларошфуко \
	Том' 'Лерер \
	Сэмюэль' 'Голдвин \
	Билл' 'Воган \
	Каллен' 'Хайтауэр \
	Боб' 'Хоуп \
	Пола' 'Уолл \
	Дэниел' 'Дж.' 'Бурстин \
	Энид' 'Блайтон \
	Чарли' 'Чаплин \
	Джордж' 'Карлин \
	Джон' 'Вуден \
	Сальвадор' 'Дали \
	Ральф' 'Уолдо' 'Эмерсон \
	Оскар' 'Уайльд \
	Денис' 'Уэйтли \
	Артур' 'Шопенгауэр \
	Хенни' 'Янгман \
	Авраам' 'Линкольн \
	Стив' 'Мараболи \
	Мэрилин' 'Монро \
	Оскар' 'Уайльд \
	Джо' 'Жирар \
	Пабло' 'Пикассо \
	Оскар' 'Уайльд \
	Гомер' 'Симпсон \
	Элвис' 'Пресли \
	Артур' 'Кларк \
	Уинстон' 'Черчилль \
	Томас' 'А.' 'Эдисон \
	Билли' 'Берк \
	Махатма' 'Ганди \
	Мэрилин' 'Монро \
	Альберт' 'Эйнштейн \
	Джастин' 'Сьюэлл \
	Джейсон' 'Лав \
	Уэйн' 'У.' 'Дайер \
	'' \
	Филлис' 'Диллер \
	Эжен' 'Ионеско' 'Decouvertes \
	Марк' 'Твен \
	Конфуций \
	Луис' 'Агассис \
	Мигель' 'де' 'Унамуно \
	Айн' 'Рэнд \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Илон' 'Маск \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Арнольд' 'Шварценеггер \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Стив' 'Джобс \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Уоррен' 'Баффет \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Элеонора' 'Рузвельт \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Билл' 'Гейтс \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Альберт' 'Эйнштейн \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Джефф' 'Безос \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Айн' 'Рэнд \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Джоан' 'Роулинг \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Опра' 'Уинфри \
	Роберт' 'Кийосаки \
	Роберт' 'Кийосаки

QUOTES = \
	Соберись,' 'тряпка! \
	Хватит' 'ныть,' 'бездарь. \
	Рано' 'сдаёшься. \
	Новый' 'день' '-' 'новый' 'пиздец.' 'Так' 'что' 'встал' 'и' 'пошёл. \
	Аварийный' 'выход' 'на' 'высоте' '30' 'тысяч' 'футов.' 'Иллюзия' 'безопасности... \
	Мы' 'были' 'на' 'волосок' 'от' 'жизни! \
	Лишь' 'утратив' 'всё' 'до' 'конца,' 'мы' 'обретаем' 'свободу. \
	Вещи,' 'которыми' 'ты' 'владеешь,' 'в' 'конце' 'концов' 'овладевают' 'тобой. \
	Не' 'разбив' 'яиц,' 'омлет' 'не' 'приготовишь. \
	Это' 'самое' 'лучшее,' 'что' 'только' 'может' 'в' 'жизни' 'случиться' '-' 'когда' 'тебя' 'увольняют,' 'ты' 'перестаешь' 'толочь' 'воду' 'в' 'ступе' 'и' 'начинаешь' 'что-то' 'менять' 'в' 'своей' 'жизни. \
	Неповторимая' 'красота' 'снежинки' '—' 'это' 'не' 'про' 'вас. \
	Ни' 'великой' 'войны,' 'ни' 'великой' 'депрессии.' 'Наша' 'война' '—' 'война' 'духовная,' 'наша' 'депрессия' '—' 'наша' 'жизнь. \
	Вопрос' 'этикета:' 'как' 'повернуться,' 'проходя' 'мимо' 'вас?' 'Задницей' 'или' 'мошонкой? \
	Если' 'у' 'тебя' 'перо' 'в' 'заднице,' 'это' 'еще' 'не' 'значит,' 'что' 'ты' 'павлин. \
	Мы' 'из' 'поколения' 'мужчин,' 'выращенных' 'женщинами.' 'Поможет' 'ли' 'другая' 'женщина' 'в' 'решении' 'наших' 'проблем? \
	Перестань' 'ты' 'за' 'все' 'цепляться' 'и' 'наплюй' 'на' 'все...' 'Наплюй! \
	Ты' 'не' 'имеешь' 'права' 'на' 'печальную' 'и' 'трагичную' 'смерть:' '' 'твоя' 'смерть' 'должна' 'быть' 'радостной,' 'возвышающей' 'смертью. \
	Мы' 'ходим' 'на' 'работу,' 'которую' 'ненавидим,' 'чтобы' 'купить' 'барахло,' 'которое' 'нам' 'не' 'нужно. \
	Я' 'хочу' 'знать' 'всё.' '-' 'К' 'хренам' 'твои' 'знания.' 'Забыть' 'всё,' 'что' 'знаешь,' '–' 'вот' 'что' 'нужно.' 'Всё,' 'что' 'якобы' 'знаешь' 'о' 'жизни,' 'о' 'любви' 'и' 'дружбе,' 'и' 'главное' '—' 'о' 'нас' 'с' 'тобой. \
	Ударь' 'меня...' 'Не' 'хочу' 'умирать' 'без' 'шрамов! \
	Эй,' 'и' 'Мона' 'Лиза' 'потихоньку' 'разрушается. \
	Ты' '–' 'лишь' 'кучка' 'испражнений' 'жизни. \
	Жизнь' 'намного' 'интересней,' 'когда' 'в' 'ней' 'есть' 'ты. \
	К' 'черту' 'законченность.' 'Хватит' 'быть' 'совершенным.' 'Давай...' 'давай' 'развиваться.' 'А' 'там' '—' 'как' 'карта' 'ляжет. \
	Кто' 'мы' 'такие?' 'Мы' 'просто' 'потребители,' 'одержимые' 'внешней' 'атрибутикой' 'преуспевания.' 'Война,' 'голод,' 'насилие' '—' 'всё' 'это' 'не' 'волнует.' 'А' 'волнует' 'меня:' 'знаменитости' 'и' 'скандалы,' 'телевизор,' 'где' '500' 'каналов' 'и' 'чье' 'имя' 'на' 'бирке' 'моих' 'трусов. \
	Ты' '—' 'это' 'не' 'твоя' 'работа.' 'Ты' '—' 'это' 'не' 'сколько' 'денег' 'у' 'тебя' 'в' 'банке.' 'Ты' '—' 'это' 'не' 'машина,' 'которую' 'ты' 'водишь.' 'Ты' '—' 'это' 'не' 'содержимое' 'твоего' 'кошелька.' 'Ты' '—' 'это' 'не' 'ключи' 'от' 'машины.' 'Ты' '—' 'это' 'поющее' 'и' 'танцующее' 'дерьмо,' 'центр' 'этого' 'мира... \
	Если' 'вы' 'это' 'читаете,' 'значит,' 'это' 'предупреждение' 'для' 'вас.' 'Каждое' 'прочтённое' 'вами' 'бесполезное' 'слово' 'отнимает' 'секунду' 'вашей' 'жизни.' 'Вам' 'что,' 'больше' 'делать' 'нечего?' 'Ваша' 'жизнь' 'настолько' 'пуста,' 'что' 'вы' 'действительно' 'не' 'в' 'состоянии' 'найти' 'себе' 'занятие' 'поинтереснее?' 'Или' 'власти' 'настолько' 'поразили' 'вас' 'своим' 'уважением' 'и' 'доверием' 'ко' 'всем' 'кому' 'ни' 'попадя?' 'Вы' 'читаете' 'всё,' 'что' 'должны' 'прочитать?' 'Вы' 'думаете' 'обо' 'всём,' 'о' 'чём' 'должны' 'думать?' 'Покупаете' 'всё,' 'что' 'преподносится' 'как' 'необходимое' 'вам?' 'Выходите' 'из' 'своей' 'квартиры.' 'Познакомьтесь' 'с' 'человеком' 'противоположного' 'пола.' 'Прекращайте' 'скупать' 'вещи' 'и' 'онанировать.' 'Бросайте' 'свою' 'работу.' 'Развяжите' 'драку.' 'Докажите,' 'что' 'вы' 'живы.' 'Если' 'вы' 'не' 'заявите' 'права' 'на' 'свою' 'человечность,' 'то' 'станете' 'цифрами' 'в' 'статических' 'отчётах.' 'Я' 'вас' 'предупредил. \
	Самосовершенствование' '—' 'это' 'онанизм.' 'Саморазрушение' '—' 'вот' 'ради' 'чего' 'стоит' 'жить! \
	Накачанным' 'может' 'себя' 'назвать' 'любое' 'суфле. \
	Приходится' 'попотеть,' 'чтобы' 'достичь' 'совершенства,' 'но' 'минутное' 'совершенство' 'оправдывает' 'все' 'усилия.' 'От' 'совершенства' 'и' 'требовать' 'нельзя,' 'чтобы' 'оно' 'длилось' 'дольше. \
	Этот' 'мир' 'отныне' 'принадлежит' 'нам,' 'нам' 'и' 'только' 'нам.' 'Древние' 'давно' 'в' 'могилах. \
	Если' 'ты' 'не' 'разработаешь' 'свой' 'собственный' 'план' 'жизни,' 'есть' 'шанс,' 'что' 'ты' 'попадешь' 'в' 'чей-то' 'другой' 'план.' 'И' 'угадай,' 'что' 'они' 'запланировали' 'для' 'тебя?' 'Не' 'очень' 'много. \
	Если' 'ты' 'заканчиваешь' 'скучную,' 'несчастную' 'жизнь,' 'потому' 'что' 'слушал' 'свою' 'маму,' 'своего' 'папу,' 'своего' 'учителя,' 'своего' 'священника' 'или' 'какого-то' 'парня' 'по' 'телевизору,' 'который' 'говорил' 'тебе,' 'как' 'делать' 'своё' 'дерьмо,' 'то' 'ты' 'это' 'заслужил. \
	Если' 'нам' 'не' 'положено' 'устраивать' 'полуночные' 'перекусы,' 'зачем' 'в' 'холодильнике' 'свет? \
	Жизнь' 'трудна'; 'она' 'труднее,' 'если' 'ты' 'глуп. \
	Я' 'хочу' 'быть' 'похожим' 'на' 'гусеницу.' 'Много' 'есть.' 'Спать' 'некоторое' 'время.' 'Проснуться' 'красивым. \
	Слишком' 'много' 'хорошего' 'может' 'быть' 'прекрасным. \
	Дорогая' 'жизнь,' 'когда' 'я' 'сказал:' '“Может' 'ли' 'мой' 'день' 'стать' 'еще' 'хуже?”.' 'Это' 'был' 'риторический' 'вопрос,' 'а' 'не' 'вызов. \
	Перемены' '-' 'это' 'не' 'слово' 'из' 'четырех' 'букв…' 'но' 'зачастую' 'твоя' 'реакция' 'на' 'них' 'такова! \
	Великие' 'духи' 'всегда' 'встречали' 'жестокое' 'сопротивление' 'со' 'стороны' 'посредственных' 'умов. \
	В' 'свою' 'защиту' 'могу' 'сказать,' 'что' 'я' 'остался' 'без' 'присмотра. \
	Беспокойство' 'похоже' 'на' 'карапуза.' 'Оно' 'никогда' 'не' 'перестает' 'говорить.' 'Говорит' 'тебе,' 'что' 'ты' 'во' 'всем' 'не' 'прав.' 'Будит' 'тебя' 'в' 'три' 'часа' 'ночи. \
	Чем' 'больше' 'ты' 'весишь,' 'тем' 'сложнее' 'тебя' 'похитить.' 'Оставайся' 'в' 'безопасности.' 'Съешь' 'торт. \
	Старайся' 'быть' 'похожим' 'на' 'черепаху' '-' 'спокойно' 'находиться' 'в' 'собственном' 'панцире. \
	Я' 'хожу' 'вокруг,' 'как' 'будто' 'все' 'в' 'порядке.' 'Но' 'в' 'глубине' 'души,' 'внутри' 'моего' 'шоу,' 'мой' 'носок' 'сползает. \
	Если' 'ты' 'попытаешься' 'потерпеть' 'неудачу' 'и' 'преуспеешь,' 'что' 'ты' 'сделал? \
	Я' 'думаю,' 'что' 'мой' 'ангел-хранитель' 'пьет. \
	День' 'без' 'солнца' '-' 'это' 'как,' 'знаешь' 'ли,' 'ночь. \
	Дремать' '-' 'это' 'звучит' 'так' 'по-детски.' 'Я' 'предпочитаю' 'называть' 'их' 'горизонтальными' 'жизненными' 'паузами. \
	Мой' 'психотерапевт' 'сказал' 'мне,' 'что' 'способ' 'достичь' 'настоящего' 'внутреннего' 'покоя' '-' 'это' 'доводить' 'до' 'конца' 'то,' 'что' 'я' 'начинаю.' 'На' 'данный' 'момент' 'я' 'доел' 'два' 'пакетика' 'M'&'Ms' 'и' 'шоколадный' 'торт.' 'Я' 'уже' 'чувствую' 'себя' 'лучше. \
	Никогда' 'не' 'позволяй' 'никому' 'относиться' 'к' 'тебе' 'как' 'к' 'желтой' 'звездочке.' 'Ты' '-' 'розовый' 'звездопад. \
	Уважай' 'своих' 'родителей.' 'Они' 'прошли' 'школу' 'без' 'Google. \
	Эдисон' 'потерпел' 'неудачу' '10' '000' 'раз,' 'прежде' 'чем' 'создал' 'электрический' 'свет.' 'Не' 'отчаивайся,' 'если' 'ты' 'потерпишь' 'неудачу' 'несколько' 'раз. \
	Если' 'поначалу' 'у' 'тебя' 'ничего' 'не' 'получается,' 'то' 'парашютизм' 'точно' 'не' 'для' 'тебя. \
	Люди' 'часто' 'говорят,' 'что' 'мотивация' 'не' 'длится' 'долго.' 'Что' 'ж,' 'так' 'же' 'как' 'и' 'баня' '-' 'вот' 'почему' 'мы' 'рекомендуем' 'делать' 'ее' 'ежедневно. \
	Хорошие' 'вещи' 'приходят' 'к' 'тем,' 'кто' 'ждет…' 'более' 'великие' 'вещи' 'приходят' 'к' 'тем,' 'кто' 'оторвет' 'свою' 'задницу' 'и' 'сделает' 'все,' 'чтобы' 'это' 'произошло. \
	Ты' 'можешь' 'дожить' 'до' 'ста' 'лет,' 'если' 'откажешься' 'от' 'всех' 'вещей,' 'которые' 'заставляют' 'тебя' 'хотеть' 'дожить' 'до' 'ста' 'лет. \
	Что' 'бы' 'ты' 'ни' 'делал,' 'всегда' 'выкладывайся' 'на' '100%.' 'Если' 'только' 'ты' 'не' 'сдаешь' 'кровь. \
	Ты' 'не' 'можешь' 'ждать' 'вдохновения.' 'Ты' 'должен' 'идти' 'за' 'ним' 'с' 'дубиной. \
	Возможность' 'не' 'стучится,' 'она' 'представляется,' 'когда' 'ты' 'выбиваешь' 'дверь. \
	Неудача' '-' 'это' 'приправа,' 'которая' 'придает' 'успеху' 'вкус. \
	Тебе' 'дана' 'лишь' 'маленькая' 'искорка' 'безумия.' 'Ты' 'не' 'должен' 'ее' 'потерять. \
	Дружба' '-' 'это' 'как' 'моча' 'на' 'себя:' 'все' 'это' 'видят,' 'но' 'только' 'ты' 'получаешь' 'то' 'теплое' 'чувство,' 'которое' 'она' 'приносит. \
	Когда' 'жизнь' 'ставит' 'тебя' 'в' 'трудную' 'ситуацию,' 'не' 'говори' '“Почему' 'я?”,' 'скажи' '“Попробуй' 'меня”. \
	Никогда' 'не' 'позволяй' 'своему' 'чувству' 'морали' 'мешать' 'тебе' 'делать' 'то,' 'что' 'правильно. \
	Если' 'ты' 'собираешься' 'думать,' 'ты' 'можешь' 'думать' 'по-крупному. \
	Я' 'намерен' 'жить' 'вечно.' 'Пока' 'что' 'все' 'хорошо. \
	Если' 'ты' 'собираешься' 'иметь' 'возможность' 'оглянуться' 'на' 'что-то' 'и' 'посмеяться' 'над' 'этим,' 'то' 'лучше' 'посмеяться' 'над' 'этим' 'сейчас. \
	Не' 'беспокойся' 'о' 'том,' 'что' 'сегодня' 'наступит' 'конец' 'света.' 'В' 'Австралии' 'он' 'наступит' 'уже' 'завтра. \
	Жизнь' 'похожа' 'на' 'канализацию…' 'то,' 'что' 'ты' 'из' 'нее' 'получишь,' 'зависит' 'от' 'того,' 'что' 'ты' 'в' 'нее' 'вложишь. \
	Золушка' 'доказывает,' 'что' 'новая' 'пара' 'туфель' 'может' 'изменить' 'твою' 'жизнь. \
	Жизнь' 'слишком' 'коротка,' 'чтобы' 'постоянно' 'быть' 'серьезным.' 'Поэтому,' 'если' 'ты' 'не' 'можешь' 'посмеяться' 'над' 'собой,' 'позвони' 'мне…' 'Я' 'посмеюсь' 'над' 'тобой. \
	Большинство' 'людей' 'упускают' 'возможность,' 'потому' 'что' 'она' 'одета' 'в' 'спецодежду' 'и' 'выглядит' 'как' 'работа. \
	Вот' 'тест,' 'который' 'поможет' 'узнать,' 'закончена' 'ли' 'твоя' 'миссия' 'на' 'земле:' 'Если' 'ты' 'жив,' 'то' 'нет. \
	Люди,' 'которые' 'задаются' 'вопросом,' 'наполовину' 'пуст' 'стакан' 'или' 'наполовину' 'полон,' 'упускают' 'суть.' 'Стакан' 'можно' 'наполнять. \
	Хорошо' 'воспитанные' 'женщины' 'редко' 'творят' 'историю. \
	Жизнь' 'всегда' 'предлагает' 'тебе' 'второй' 'шанс,' 'он' 'называется' '“завтра”. \
	Когда' 'я' 'слышу,' 'как' 'кто-то' 'вздыхает:' '“Жизнь' 'тяжела”,' 'меня' 'всегда' 'тянет' 'спросить:' '“По' 'сравнению' 'с' 'чем?” \
	Если' 'ты' 'не' 'знаешь,' 'куда' 'идешь,' 'то' 'можешь' 'оказаться' 'в' 'другом' 'месте. \
	Подавлять' 'смех' '-' 'это' 'плохо.' 'Он' 'возвращается' 'вниз' 'и' 'распространяется' 'на' 'твои' 'бедра. \
	Иногда' 'лучшая' 'часть' 'моей' 'работы' 'заключается' 'в' 'том,' 'что' 'мой' 'стул' 'вращается. \
	Никогда' 'не' 'было' 'такого' 'прекрасного' 'ребенка,' 'но' 'его' 'мать' 'была' 'рада,' 'когда' 'он' 'засыпал. \
	Все,' 'что' 'тебе' 'нужно' 'в' 'этой' 'жизни,' '-' 'это' 'незнание' 'и' 'уверенность,' 'и' 'тогда' 'успех' 'обеспечен. \
	У' 'меня' 'простая' 'философия:' 'Наполни' 'то,' 'что' 'пусто.' 'Опустошай' 'то,' 'что' 'переполнено.' 'Почеши' 'там,' 'где' 'чешется. \
	Получается,' 'что' 'быть' 'взрослым' '-' 'это' 'просто' 'гуглить,' 'как' 'делать' 'то-то' 'и' 'то-то. \
	Мне' 'потребовалось' 'пятнадцать' 'лет,' 'чтобы' 'обнаружить,' 'что' 'у' 'меня' 'нет' 'писательского' 'таланта,' 'но' 'я' 'не' 'мог' 'бросить' 'это' 'занятие,' 'потому' 'что' 'к' 'тому' 'времени' 'я' 'был' 'слишком' 'знаменит. \
	Честную' 'критику' 'трудно' 'воспринимать,' 'особенно' 'от' 'родственника,' 'друга,' 'знакомого' 'или' 'незнакомца. \
	Почему' 'понедельник' 'так' 'далек' 'от' 'пятницы,' 'а' 'пятница' 'так' 'близка' 'к' 'понедельнику? \
	Ты' 'должен' 'заплатить' 'за' 'свои' 'грехи.' 'Если' 'ты' 'уже' 'заплатил,' 'пожалуйста,' 'проигнорируй' 'это' 'уведомление. \
	Следуй' 'своей' 'страсти,' 'оставайся' 'верным' 'себе,' 'никогда' 'не' 'иди' 'по' 'чужому' 'пути,' 'если' 'только' 'ты' 'не' 'в' 'лесу' 'и' 'не' 'заблудился' 'и' 'не' 'увидел' 'тропинку,' 'тогда' 'во' 'что' 'бы' 'то' 'ни' 'стало' 'ты' 'должен' 'идти' 'по' 'ней. \
	Удача' '-' 'это' 'то,' 'что' 'у' 'тебя' 'остается' 'после' 'того,' 'как' 'ты' 'выкладываешься' 'на' '100' 'процентов. \
	Никогда' 'не' 'откладывай' 'на' 'завтра' 'то,' 'что' 'ты' 'можешь' 'сделать' 'послезавтра. \
	Сначала' 'получи' 'факты,' 'а' 'потом' 'можешь' 'искажать' 'их' 'как' 'угодно. \
	Деньги' 'не' 'сделают' 'тебя' 'счастливым…' 'но' 'каждый' 'хочет' 'выяснить' 'это' 'для' 'себя. \
	Уборка' '-' 'это' 'просто' 'размещение' 'вещей' 'в' 'менее' 'очевидных' 'местах. \
	Я' 'благословлён' 'геном' 'веселья,' 'который' 'заставляет' 'меня' 'наслаждаться' 'жизнью. \
	У' 'тебя' 'есть' 'мозги' 'в' 'голове.' 'У' 'тебя' 'есть' 'ноги' 'в' 'обуви.' 'Ты' 'можешь' 'направлять' 'себя' 'в' 'любую' 'сторону,' 'которую' 'выберешь.' 'Ты' 'самостоятелен.' 'И' 'ты' 'знаешь' 'то,' 'что' 'знаешь.' 'И' 'именно' 'ТЫ' 'будешь' 'решать,' 'куда' 'идти. \
	Я' 'должна' 'быть' 'успешной,' 'потому' 'что' 'мне' 'нравятся' 'дорогие' 'вещи. \
	Ненавидеть' 'людей' '-' 'все' 'равно' 'что' 'сжечь' 'собственный' 'дом,' 'чтобы' 'избавиться' 'от' 'крысы. \
	Не' 'все' 'бури' 'приходят,' 'чтобы' 'разрушить' 'твою' 'жизнь.' 'Некоторые' 'приходят,' 'чтобы' 'расчистить' 'твой' 'путь... \
	Слушай,' 'улыбайся,' 'соглашайся,' 'а' 'потом' 'делай' 'то,' 'что' 'ты' 'все' 'равно' 'собирался' 'делать. \
	Лучший' 'способ' 'оценить' 'свою' 'работу' '-' 'представить' 'себя' 'без' 'неё. \
	Жизнь' 'забавно' 'устроена.' 'Как' 'раз' 'тогда,' 'когда' 'ты' 'начинаешь' 'верить,' 'что' 'этого' 'никогда' 'не' 'произойдет. \
	Делать' 'или' 'не' 'делать.' 'Нет' 'никакой' 'попытки. \
	Ты' 'должен' 'учиться' 'на' 'ошибках' 'других.' 'Ты' 'не' 'сможешь' 'прожить' 'достаточно' 'долго,' 'чтобы' 'совершить' 'их' 'все' 'самому. \
	Лучшая' 'страховка' 'на' 'завтра' '-' 'это' 'максимально' 'продуктивное' 'использование' 'сегодняшнего' 'дня. \
	Перестань' 'сомневаться' 'в' 'себе,' 'упорно' 'трудись' 'и' 'добейся' 'успеха! \
	Если' 'ты' 'упадешь,' 'я' 'всегда' 'буду' 'рядом.' '-' 'Пол \
	Я' 'считаю' 'телевидение' 'очень' 'познавательным.' 'Каждый' 'раз,' 'когда' 'кто-то' 'включает' 'его,' 'я' 'ухожу' 'в' 'другую' 'комнату' 'и' 'читаю' 'книгу. \
	Первые' 'пять' 'дней' 'после' 'выходных' '-' 'самые' 'трудные. \
	Будь' 'как' 'почтовая' 'марка.' 'Придерживайся' 'какого-то' 'дела,' 'пока' 'не' 'добьешься' 'своего. \
	Люди' 'говорят,' 'что' 'нет' 'ничего' 'невозможного,' 'но' 'я' 'каждый' 'день' 'ничего' 'не' 'делаю. \
	Иногда' 'я' 'всю' 'встречу' 'удивляюсь,' 'как' 'они' 'пронесли' 'большой' 'стол' 'для' 'совещаний' 'через' 'дверь. \
	Мне' 'скучно' '-' 'это' 'бесполезная' 'вещь,' 'которую' 'можно' 'сказать.' 'Я' 'имею' 'в' 'виду,' 'что' 'ты' 'живешь' 'в' 'большом,' 'огромном,' 'необъятном' 'мире,' 'в' 'котором' 'ты' 'не' 'видел' 'и' 'процента.' 'Даже' 'внутренний' 'мир' 'твоего' 'собственного' 'разума' 'бесконечен'; 'он' 'продолжается' 'вечно,' 'внутренне,' 'понимаешь?' 'Сам' 'факт' 'того,' 'что' 'ты' 'жив,' 'удивителен,' 'поэтому' 'ты' 'не' 'можешь' 'сказать:' '“Мне' 'скучно”. \
	Смотреть' 'на' 'прошлое' 'и' 'будущее' '-' 'это' 'нормально.' 'Просто' 'не' 'пялься. \
	Тот,' 'кто' 'сказал:' '“Главное' 'не' 'то,' 'выиграешь' 'ты' 'или' 'проиграешь”,' '-' 'вероятно,' 'проиграл. \
	Фокус,' 'фокус,' 'фокус!' 'Я' 'что,' 'телескоп?! \
	Если' 'план' 'не' 'работает,' 'измени' 'план.' 'Но' 'цель' '-' 'никогда. \
	Не' 'думаю,' 'что' 'для' 'этого' 'понедельника' 'будет' 'достаточно' 'кофе' 'или' 'средних' 'пальцев. \
	Я' 'всегда' 'хотела' 'быть' 'кем-то,' 'но' 'теперь' 'я' 'понимаю,' 'что' 'мне' 'следовало' 'быть' 'более' 'конкретной. \
	Работа' 'в' 'команде' 'означает,' 'что' 'никогда' 'не' 'нужно' 'брать' 'всю' 'вину' 'на' 'себя. \
	Даже' 'если' 'ты' 'на' 'правильном' 'пути,' 'тебя' 'переедут,' 'если' 'ты' 'будешь' 'просто' 'сидеть' 'на' 'месте. \
	Его' 'бессонница' 'была' 'настолько' 'сильной,' 'что' 'он' 'не' 'мог' 'спать' 'в' 'рабочее' 'время. \
	Добросовестно' 'работая' 'по' 'восемь' 'часов' 'в' 'день,' 'ты' 'в' 'конце' 'концов' 'можешь' 'стать' 'боссом' 'и' 'работать' 'по' 'двенадцать' 'часов' 'в' 'день. \
	Даже' 'остановившиеся' 'часы' 'правы' 'дважды' 'каждый' 'день.' 'Через' 'несколько' 'лет' 'он' 'может' 'похвастаться' 'длинной' 'серией' 'успехов. \
	Я' 'не' 'смог' 'починить' 'твои' 'тормоза,' 'поэтому' 'сделал' 'твой' 'гудок' 'громче. \
	Не' 'воспринимай' 'жизнь' 'слишком' 'серьезно.' 'Ты' 'никогда' 'не' 'выйдешь' 'из' 'нее' 'живым. \
	При' 'искушении' 'бороться' 'с' 'огнем' 'с' 'помощью' 'огня,' 'помни,' 'что' 'пожарная' 'служба' 'обычно' 'использует' 'воду. \
	Работайте' 'до' 'тех' 'пор,' 'пока' 'ваш' 'банковский' 'счет' 'не' 'станет' 'похож' 'на' 'номер' 'телефона. \
	Чистая' 'совесть' '-' 'верный' 'признак' 'плохой' 'памяти. \
	Думай' 'как' 'протон.' 'Всегда' 'позитивно. \
	Бриллиант' '-' 'это' 'всего' 'лишь' 'кусок' 'угля,' 'который' 'хорошо' 'показал' 'себя' 'под' 'давлением. \
	Дорога' 'к' 'успеху' 'усеяна' 'множеством' 'заманчивых' 'парковочных' 'мест. \
	Если' 'бы' 'мир' 'не' 'был' 'отстойным,' 'мы' 'бы' 'все' 'полетели' 'в' 'космос. \
	Когда' 'мне' 'грустно,' 'я' 'перестаю' 'быть' 'грустным' 'и' 'вместо' 'этого' 'становлюсь' 'офигенным. \
	Я' 'настолько' 'умен,' 'что' 'иногда' 'не' 'понимаю' 'ни' 'единого' 'слова' 'из' 'того,' 'что' 'говорю. \
	Жизнь' '-' 'это' 'чистый' 'холст,' 'и' 'тебе' 'нужно' 'бросить' 'на' 'него' 'все' 'краски,' 'которые' 'ты' 'можешь. \
	Лидерство' '-' 'это' 'искусство' 'заставить' 'кого-то' 'другого' 'сделать' 'то,' 'что' 'ты' 'хочешь,' 'потому' 'что' 'он' 'хочет' 'это' 'сделать. \
	Проблема' 'с' 'открытым' 'разумом,' 'конечно,' 'в' 'том,' 'что' 'люди' 'будут' 'настаивать' 'на' 'том,' 'чтобы' 'прийти' 'и' 'попытаться' 'вложить' 'в' 'него' 'что-то. \
	Каждая' 'татуировка' 'временная,' 'потому' 'что' 'мы' 'все' 'медленно' 'умираем. \
	На' 'протяжении' 'дополнительной' 'мили' 'нет' 'пробок. \
	Жизнь' 'похожа' 'на' 'фотографию.' 'Тебе' 'нужны' 'негативы,' 'чтобы' 'развиваться. \
	Может' 'оказаться,' 'что' 'твое' 'предназначение' 'в' 'жизни' '-' 'служить' 'предупреждением' 'для' 'других. \
	Если' 'ты' 'думаешь,' 'что' 'ты' 'слишком' 'мал,' 'чтобы' 'что-то' 'изменить,' 'попробуй' 'спать' 'с' 'комаром. \
	Раньше' 'я' 'думала,' 'что' 'я' 'нерешительная,' 'но' 'теперь' 'я' 'не' 'так' 'уверена. \
	Нет' 'ничего' 'невозможного,' 'само' 'слово' 'говорит:' '“Я' 'возможен! \
	Я' 'не' 'провалил' 'тест.' 'Я' 'просто' 'нашел' '100' 'способов' 'сделать' 'его' 'неправильно \
	Мечты' 'подобны' 'радуге.' 'Только' 'идиоты' 'гоняются' 'за' 'ними. \
	Кексы' '-' 'это' 'кексы,' 'которые' 'верили' 'в' 'чудеса. \
	Из' 'плохих' 'решений' 'получаются' 'хорошие' 'истории. \
	Ты' 'не' 'можешь' 'иметь' 'все.' 'Куда' 'бы' 'ты' 'это' 'всё' 'положил? \
	Я' 'ранняя' 'пташка' 'и' 'ночная' 'сова…' 'поэтому' 'я' 'мудр' 'и' 'у' 'меня' 'есть' 'черви \
	Счастье' '-' 'это' 'просто' 'печаль,' 'которая' 'еще' 'не' 'случилась. \
	Всегда' 'помните,' 'что' 'вы' 'уникальны' '-' 'так' 'же,' 'как' 'и' 'все' 'остальные. \
	Жизнь' '-' 'это' 'кораблекрушение,' 'но' 'мы' 'не' 'должны' 'забывать' 'петь' 'в' 'спасательных' 'шлюпках \
	Никогда' 'не' 'хватает' 'времени,' 'чтобы' 'сделать' 'всё' 'то,' 'что' 'ты' 'хочешь \
	Будьте' 'счастливы' '-' 'это' 'сводит' 'людей' 'с' 'ума. \
	Эти' 'горы,' 'которые' 'ты' 'несешь,' 'ты' 'должен' 'был' 'только' 'взобраться' 'на' 'них. \
	Ты' 'взрослеешь' 'в' 'тот' 'день,' 'когда' 'впервые' 'по-настоящему' 'смеёшься' '-' 'над' 'собой. \
	Не' 'нужно' 'ничего,' 'чтобы' 'присоединиться' 'к' 'толпе.' 'Нужно' 'все,' 'чтобы' 'стоять' 'в' 'одиночестве. \
	Когда' 'жизнь' 'приносит' 'большие' 'ветры' 'перемен,' 'которые' 'почти' 'сдувают' 'тебя,' 'закрой' 'глаза,' 'держись' 'крепче' 'и' 'верь. \
	Ты' 'все' 'еще' 'рок-звезда.' 'шепчу' 'я' 'себе,' 'принимая' 'мультивитамин' 'и' 'ложась' 'в' 'постель' 'в' '9' 'часов' 'вечера. \
	Никогда' 'не' 'переставай' 'делать' 'все,' 'что' 'в' 'твоих' 'силах,' 'только' 'потому,' 'что' 'кто-то' 'не' 'отдает' 'тебе' 'должное. \
	Я' 'никогда' 'не' 'был' 'по-настоящему' 'безумен,' 'за' 'исключением' 'тех' 'случаев,' 'когда' 'мое' 'сердце' 'было' 'тронуто. \
	Я' 'считаю,' 'что' 'если' 'жизнь' 'дает' 'тебе' 'лимоны,' 'ты' 'должен' 'сделать' 'лимонад…' 'И' 'постарайся' 'найти' 'кого-нибудь,' 'чья' 'жизнь' 'дала' 'ему' 'водку,' 'и' 'устроить' 'вечеринку. \
	Я' 'мечтаю' 'о' 'лучшем' 'мире,' 'где' 'цыпленок' 'может' 'переходить' 'дорогу' 'без' 'того,' 'чтобы' 'его' 'мотивы' 'ставились' 'под' 'сомнение. \
	Будь' 'смелым.' 'Даже' 'если' 'это' 'не' 'так,' 'притворись,' 'что' 'это' 'так. \
	Когда' 'мне' 'было' '5' 'лет,' 'моя' 'мама' 'всегда' 'говорила' 'мне,' 'что' 'счастье' '-' 'это' 'ключ' 'к' 'жизни.' 'Когда' 'я' 'пошел' 'в' 'школу,' 'меня' 'спросили,' 'кем' 'я' 'хочу' 'стать,' 'когда' 'вырасту.' 'Я' 'записал' '“счастливым”.' 'Они' 'сказали' 'мне,' 'что' 'я' 'не' 'понимаю' 'задания,' 'а' 'я' 'сказал' 'им,' 'что' 'они' 'не' 'понимают' 'жизни. \
	Я' 'кое-что' 'понял.' 'Будущее' 'непредсказуемо. \
	Возможность' 'всегда' 'стучится.' 'Проблема' 'в' 'том,' 'что' 'у' 'большинства' 'людей' 'станция' 'сомнения' 'в' 'себе' 'в' 'голове' 'включена' 'слишком' 'громко,' 'чтобы' 'услышать' 'её. \
	Когда' 'ты' 'фокусируешься' 'на' 'хорошем,' 'хорошее' 'становится' 'лучше. \
	Если' 'мой' 'путь' 'отличается,' 'это' 'не' 'значит,' 'что' 'я' 'заблудился. \
	Будь' 'вежлив' 'с' 'ботаниками.' 'Возможно,' 'в' 'итоге' 'ты' 'будешь' 'работать' 'на' 'них.' 'Мы' 'все' 'можем. \
	Когда' 'жизнь' 'закрывает' 'дверь…' 'открой' 'ее' 'снова.' 'Вот' 'как' 'они' 'работают. \
	Вероятно,' 'я' 'никогда' 'полностью' 'не' 'стану' 'той,' 'кем' 'хотела' 'быть,' 'когда' 'вырасту,' 'но' 'это,' 'наверное,' 'потому,' 'что' 'я' 'хотела' 'быть' 'принцессой' 'ниндзя. \
	Я' 'не' 'выступаю' 'за' 'насилие.' 'Я' 'выступаю' 'за' 'мир.' 'А' 'потом,' 'как' 'раз' 'когда' 'мой' 'противник' 'верит' 'мне,' 'я' 'бью' 'его' 'по' 'лицу. \
	Никогда' 'не' 'переставай' 'учиться,' 'потому' 'что' 'жизнь' 'никогда' 'не' 'перестает' 'учить. \
	Причина,' 'по' 'которой' 'я' 'разговариваю' 'сам' 'с' 'собой,' 'заключается' 'в' 'том,' 'что' 'я' 'единственный,' 'чьи' 'ответы' 'я' 'принимаю. \
	Ты' 'можешь' 'сделать' 'всё!' 'Просто' 'встань' 'и' 'сделай' 'это,' 'следуй' 'за' 'своей' 'мечтой. \
	Единственный' 'раз,' 'когда' 'тебе' 'стоит' 'оглянуться' 'назад,' '-' 'это' 'чтобы' 'посмотреть' 'на' 'эту' 'попку. \
	Одежда' 'делает' 'человека.' 'Голые' 'люди' 'практически' 'не' 'влияют' 'на' 'общество. \
	Чтобы' 'добиться' 'успеха' 'в' 'жизни,' 'тебе' 'нужны' 'три' 'вещи:' 'кость' 'желаний,' 'хребет' 'и' 'смешная' 'кость. \
	Мудрость' 'приходит' 'из' 'опыта.' 'Опыт' 'часто' 'является' 'результатом' 'отсутствия' 'мудрости. \
	Пусть' 'твои' 'враги' 'живут' 'достаточно' 'долго,' 'чтобы' 'они' 'могли' 'стать' 'свидетелями' 'твоего' 'успеха. \
	Если' 'люди' 'сомневаются' 'в' 'том,' 'как' 'далеко' 'ты' 'можешь' 'зайти,' 'зайди' 'так' 'далеко,' 'чтобы' 'больше' 'не' 'слышать' 'их. \
	Позитивный' 'настрой,' 'возможно,' 'не' 'решит' 'всех' 'твоих' 'проблем,' 'но' 'он' 'будет' 'раздражать' 'достаточно' 'людей,' 'чтобы' 'это' 'стоило' 'усилий. \
	Оптимист:' 'тот,' 'кто' 'понимает,' 'что' 'сделать' 'шаг' 'назад' 'после' 'шага' 'вперед' '-' 'это' 'не' 'катастрофа,' 'это' 'больше' 'похоже' 'на' 'ча-ча-ча. \
	Если' 'ты' 'самый' 'умный' 'человек' 'в' 'комнате,' 'то' 'ты' 'находишься' 'не' 'в' 'той' 'комнате. \
	Знаешь,' 'что' 'я' 'заметил?' 'Совершенно' 'незнакомые' 'люди' 'более' 'склонны' 'помочь' 'тебе' 'добиться' 'успеха,' 'чем' 'люди,' 'которых' 'ты' 'действительно' 'знаешь. \
	Думай' 'налево' 'и' 'думай' 'направо,' 'думай' 'низко' 'и' 'думай' 'высоко.' 'О,' 'какие' 'мысли' 'ты' 'можешь' 'придумать,' 'если' 'только' 'постараешься! \
	Иногда' 'тебе' 'просто' 'нужно' 'взять' 'себя' 'в' 'руки' 'и' 'продолжать' 'жить' 'дальше… \
	Когда' 'кто-то' 'говорит,' 'что' 'ты' 'не' 'сможешь' 'этого' 'сделать.' 'Сделай' 'это' 'дважды' 'и' 'сфотографируй. \
	Помни,' 'что' 'Сегодня' '-' 'это' 'Завтра,' 'о' 'котором' 'ты' 'беспокоился' 'Вчера. \
	Ты' 'можешь' 'смеяться' 'над' 'всем,' 'но' 'не' 'со' 'всеми. \
	Я' 'добьюсь' 'успеха,' 'потому' 'что' 'я' 'достаточно' 'безумен,' 'чтобы' 'думать,' 'что' 'я' 'могу. \
	Как' 'я' 'понимаю,' 'если' 'ты' 'хочешь' 'радугу,' 'тебе' 'придется' 'терпеть' 'дождь. \
	Павлин,' 'который' 'опирается' 'на' 'свои' 'хвостовые' 'перья' '-' 'это' 'просто' 'еще' 'одна' 'индейка. \
	Иногда' 'жизнь' 'сбивает' 'тебя' 'с' 'ног…' 'вставай,' 'вставай,' 'вставай!!!' 'Счастье' '-' 'это' 'не' 'отсутствие' 'проблем,' 'это' 'способность' 'справляться' 'с' 'ними. \
	Жизнь' 'не' 'имитирует' 'искусство,' 'она' 'имитирует' 'плохое' 'телевидение. \
	Мой' 'разум' 'похож' 'на' 'мой' 'интернет-браузер.' 'У' 'меня' 'открыто' '19' 'вкладок,' '3' 'из' 'них' 'заморожены,' 'и' 'я' 'понятия' 'не' 'имею,' 'откуда' 'идет' 'музыка. \
	Хорошее,' 'Лучшее,' 'Лучшее.' 'Никогда' 'не' 'давай' 'себе' 'покоя,' 'пока' 'твое' 'хорошее' 'не' 'станет' 'лучше,' 'а' 'твое' 'лучшее' '—' 'лучшим. \
	Дорога' 'к' 'успеху' 'всегда' 'находится' 'в' 'стадии' 'строительства. \
	Если' '“план' 'А”' 'не' 'сработал.' 'В' 'алфавите' 'есть' 'еще' '25' 'букв!' 'Оставайся' 'спокойным. \
	Стремись' 'вдохновлять,' 'пока' 'мы' 'не' 'истекли. \
	Ничего' 'не' 'делать' '-' 'это' 'очень' 'сложно,' 'ты' 'никогда' 'не' 'знаешь,' 'когда' 'закончишь. \
	Когда' 'мне' 'грустно,' 'я' 'просто' 'пою,' 'а' 'потом' 'понимаю,' 'что' 'мой' 'голос' 'хуже,' 'чем' 'мои' 'проблемы. \
	Это' 'правда,' 'что' 'тяжелая' 'работа' 'никогда' 'никого' 'не' 'убивала,' 'но' 'я' 'решил,' 'зачем' 'рисковать? \
	На' 'то,' 'чтобы' 'сделать' 'всё' 'правильно,' 'уходит' 'меньше' 'времени,' 'чем' 'на' 'то,' 'чтобы' 'объяснить,' 'почему' 'ты' 'сделал' 'это' 'неправильно. \
	Будь' 'тем,' 'кто' 'ты' 'есть,' 'и' 'говори' 'то,' 'что' 'чувствуешь,' 'потому' 'что' 'те,' 'кто' 'возражает,' 'не' 'имеют' 'значения,' 'а' 'те,' 'кто' 'имеет' 'значение,' 'не' 'возражают. \
	Ты' 'не' 'можешь' 'быть' 'ничем,' 'если' 'хочешь' 'быть' 'всем. \
	Мир' 'полон' 'волшебных' 'вещей,' 'которые' 'терпеливо' 'ждут,' 'пока' 'наш' 'ум' 'станет' 'острее. \
	Средняя' 'собака' '-' 'более' 'приятный' 'человек,' 'чем' 'средний' 'человек. \
	Самый' 'верный' 'признак' 'того,' 'что' 'разумная' 'жизнь' 'существует' 'где-то' 'во' 'Вселенной,' '-' 'это' 'то,' 'что' 'она' 'никогда' 'не' 'пыталась' 'связаться' 'с' 'нами. \
	Единственное' 'время,' 'когда' 'у' 'меня' 'нет' 'проблем' 'в' 'этом' 'мире,' '-' 'это' 'когда' 'я' 'уже' 'нахожусь' 'на' 'шесть' 'футов' 'ниже' 'уровня' 'земли. \
	Мы' 'никогда' 'по-настоящему' 'не' 'взрослеем,' 'мы' 'только' 'учимся,' 'как' 'вести' 'себя' 'на' 'публике. \
	Наблюдать' 'за' 'человеком,' 'который' 'успешно' 'теряет' 'пятьдесят' 'килограммов' 'и' 'меняет' 'свою' 'жизнь,' 'более' 'вдохновляюще,' 'чем' 'слушать' 'фитнес-тренера' 'с' 'идеальным' 'телом. \
	Украсть' 'идеи' 'у' 'одного' 'человека' '-' 'это' 'плагиат'; 'украсть' 'у' 'многих' '-' 'это' 'исследование. \
	Постановка' 'целей' 'похожа' 'на' 'путешествие' 'из' 'пункта' 'А' 'в' 'пункт' 'Б' 'в' 'пределах' 'города.' 'Если' 'ты' 'четко' 'понимаешь,' 'в' 'чем' 'заключается' 'цель,' 'ты' 'обязательно' 'достигнешь' 'пункта' 'назначения,' 'потому' 'что' 'знаешь' 'его' 'адрес. \
	Ключ' 'к' 'успеху' 'лежит' 'не' 'через' 'достижения,' 'а' 'через' 'энтузиазм. \
	В' 'ту' 'минуту,' 'когда' 'ты' 'соглашаешься' 'на' 'меньшее,' 'чем' 'заслуживаешь,' 'ты' 'получаешь' 'еще' 'меньше,' 'чем' 'рассчитывал. \
	Разум' 'подобен' 'парашюту.' 'Он' 'не' 'работает,' 'если' 'не' 'открыт. \
	Каждый' 'человек' 'виновен' 'во' 'всем' 'том' 'добре,' 'которое' 'он' 'не' 'сделал. \
	Женщина' 'подобна' 'чайному' 'пакетику' '-' 'ты' 'не' 'можешь' 'сказать,' 'насколько' 'она' 'крепка,' 'пока' 'не' 'положишь' 'её' 'в' 'горячую' 'воду. \
	Мы' 'перестаем' 'играть' 'не' 'потому,' 'что' 'стареем'; 'мы' 'стареем,' 'потому' 'что' 'перестаем' 'играть. \
	Женщины' 'мудрее' 'мужчин,' 'потому' 'что' 'они' 'меньше' 'знают' 'и' 'больше' 'понимают. \
	Если' 'ты' 'собираешься' 'сказать' 'людям' 'правду,' 'будь' 'смешным,' 'иначе' 'они' 'тебя' 'убьют. \
	К' 'тому' 'времени,' 'когда' 'мужчина' 'понимает,' 'что' 'его' 'отец' 'был' 'прав,' 'у' 'него' 'уже' 'есть' 'сын,' 'который' 'считает,' 'что' 'он' 'не' 'прав. \
	Ненавистники' '-' 'это' 'просто' 'растерянные' 'поклонники,' 'потому' 'что' 'они' 'не' 'могут' 'понять' 'причину,' 'по' 'которой' 'все' 'тебя' 'любят. \
	Мы' 'все' 'здесь' 'на' 'земле,' 'чтобы' 'помогать' 'другим'; 'для' 'чего' 'на' 'земле' 'другие,' 'я' 'не' 'знаю. \
	Тот,' 'кто' 'смеется' 'последним,' 'не' 'понял' 'шутки. \
	Требуются' 'значительные' 'знания' 'только' 'для' 'того,' 'чтобы' 'осознать' 'степень' 'собственного' 'невежества. \
	Лекарство' 'от' 'скуки' '-' 'это' 'любопытство.' 'От' 'любопытства' 'нет' 'лекарства. \
	Если' 'ты' 'доживешь' 'до' 'ста' 'лет,' 'то' 'у' 'тебя' 'все' 'получится.' 'Очень' 'немногие' 'люди' 'умирают' 'после' 'этого' 'возраста. \
	Я' 'родился,' 'чтобы' 'совершать' 'ошибки,' 'а' 'не' 'симулировать' 'совершенство. \
	Мозг' '-' 'удивительный' 'орган'; 'он' 'начинает' 'работать' 'в' 'тот' 'момент,' 'когда' 'ты' 'встаешь' 'утром,' 'и' 'не' 'останавливается,' 'пока' 'ты' 'не' 'попадешь' 'в' 'офис. \
	Свет' 'распространяется' 'быстрее,' 'чем' 'звук.' 'Вот' 'почему' 'некоторые' 'люди' 'кажутся' 'яркими,' 'пока' 'ты' 'не' 'услышишь,' 'как' 'они' 'говорят. \
	Я' 'нахожусь' 'в' 'форме.' 'Круглое' '-' 'это' 'форма. \
	Хороший' 'совет' '-' 'это' 'то,' 'что' 'мужчина' 'дает,' 'когда' 'он' 'уже' 'слишком' 'стар,' 'чтобы' 'подавать' 'плохой' 'пример. \
	Я' 'знаю,' 'что' 'есть' 'люди,' 'которые' 'не' 'любят' 'своих' 'ближних,' 'и' 'я' 'ненавижу' 'таких' 'людей! \
	Я' 'не' 'хочу,' 'чтобы' 'рядом' 'со' 'мной' 'были' 'люди' '“за”.' 'Я' 'хочу,' 'чтобы' 'все' 'говорили' 'мне' 'правду,' 'даже' 'если' 'это' 'будет' 'стоить' 'им' 'работы \
	Деньги' 'не' 'купят' 'счастья,' 'но' 'они' 'заплатят' 'зарплату' 'большому' 'штату' 'исследователей,' 'которые' 'будут' 'изучать' 'эту' 'проблему \
	Смех' 'над' 'нашими' 'ошибками' 'может' 'удлинить' 'нашу' 'собственную' 'жизнь.' 'Смех' 'над' 'чужими' 'ошибками' 'может' 'укоротить' 'её. \
	Банк' '-' 'это' 'место,' 'которое' 'одолжит' 'тебе' 'деньги,' 'если' 'ты' 'сможешь' 'доказать,' 'что' 'они' 'тебе' 'не' 'нужны. \
	Жизнь' 'похожа' 'на' 'фондовый' 'рынок.' 'В' 'некоторые' 'дни' 'ты' 'поднимаешься.' 'В' 'некоторые' 'дни' 'ты' 'падаешь.' 'А' 'в' 'некоторые' 'дни' 'ты' 'чувствуешь' 'себя' 'как' 'нечто,' 'что' 'бык' 'оставил' 'позади. \
	Образование' '-' 'это' 'изучение' 'того,' 'о' 'чем' 'ты' 'даже' 'не' 'подозревал,' 'что' 'не' 'знаешь \
	Оставляй' 'что-то' 'для' 'кого-то,' 'но' 'не' 'оставляй' 'кого-то' 'для' 'чего-то. \
	День' 'без' 'смеха' '-' 'это' 'день,' 'потраченный' 'впустую. \
	Я' 'думал' 'о' 'том,' 'что' 'с' 'возрастом' 'люди,' 'кажется,' 'читают' 'Библию' 'гораздо' 'больше'; 'потом' 'меня' 'осенило' '-' 'они' 'готовятся' 'к' 'выпускному' 'экзамену. \
	Всё' 'складывается' 'наилучшим' 'образом' 'для' 'тех,' 'кто' 'делает' 'лучшее' 'из' 'того,' 'как' 'всё' 'складывается. \
	Не' 'бойся' 'совершенства.' 'Ты' 'никогда' 'его' 'не' 'достигнешь. \
	Без' 'амбиций' 'человек' 'ничего' 'не' 'начинает.' 'Без' 'работы' 'человек' 'ничего' 'не' 'заканчивает.' 'Приз' 'не' 'будет' 'послан' 'тебе.' 'Ты' 'должен' 'сам' 'его' 'завоевать. \
	Всегда' 'занимай' 'деньги' 'у' 'пессимиста.' 'Он' 'не' 'будет' 'ожидать' 'их' 'возврата. \
	Неудача' '-' 'это' 'как' 'удобрение'; 'она' 'воняет,' 'конечно,' 'но' 'в' 'будущем' 'заставляет' 'всё' 'расти' 'быстрее. \
	Талант' 'попадает' 'в' 'цель,' 'в' 'которую' 'никто' 'другой' 'попасть' 'не' 'может.' 'Гений' 'поражает' 'цель,' 'которую' 'никто' 'другой' 'не' 'может' 'увидеть. \
	Если' 'ты' 'собираешься' 'сделать' 'сегодня' 'вечером' 'что-то,' 'о' 'чем' 'будешь' 'жалеть' 'завтра' 'утром,' 'ложись' 'спать' 'поздно. \
	Лучше' 'промолчать' 'и' 'прослыть' 'дураком,' 'чем' 'высказаться' 'и' 'устранить' 'все' 'сомнения. \
	Если' 'ты' 'общаешься' 'с' 'цыплятами,' 'то' 'будешь' 'кудахтать,' 'а' 'если' 'с' 'орлами,' 'то' 'будешь' 'летать. \
	Несовершенство' '-' 'это' 'красота,' 'безумие' '-' 'это' 'гениальность,' 'и' 'лучше' 'быть' 'абсолютно' 'нелепым,' 'чем' 'абсолютно' 'скучным. \
	Мы' 'все' 'в' 'сточной' 'канаве,' 'но' 'некоторые' 'из' 'нас' 'смотрят' 'на' 'звезды. \
	Лифт' 'к' 'успеху' 'вышел' 'из' 'строя.' 'Тебе' 'придется' 'воспользоваться' 'лестницей…' 'по' 'одному' 'шагу' 'за' 'раз. \
	Выучи' 'правила' 'как' 'профессионал,' 'чтобы' 'потом' 'нарушать' 'их' 'как' 'художник. \
	Будь' 'собой'; 'все' 'остальные' 'уже' 'заняты. \
	Попытка' '-' 'это' 'первый' 'шаг' 'к' 'неудаче. \
	Если' 'ты' 'позволишь' 'своей' 'голове' 'стать' 'слишком' 'большой,' 'она' 'сломает' 'тебе' 'шею. \
	Единственный' 'способ' 'обнаружить' 'границы' 'возможного' '-' 'это' 'рискнуть' 'немного' 'выйти' 'за' 'них' 'в' 'невозможное. \
	Если' 'ты' 'проходишь' 'через' 'ад,' 'продолжай' 'идти. \
	Я' 'не' 'потерпел' 'неудачу.' 'Я' 'просто' 'нашел' '10' '000' 'способов,' 'которые' 'не' 'работают. \
	Возраст' 'не' 'имеет' 'никакого' 'значения,' 'если' 'только' 'ты' 'не' 'сыр. \
	Сначала' 'они' 'тебя' 'игнорируют,' 'потом' 'высмеивают,' 'потом' 'борются' 'с' 'тобой,' 'и' 'тогда' 'ты' 'побеждаешь. \
	Женщинам,' 'которые' 'стремятся' 'быть' 'равными' 'с' 'мужчинами,' 'не' 'хватает' 'амбиций. \
	Разница' 'между' 'гениальностью' 'и' 'глупостью' 'заключается' 'в' 'том,' 'что'; 'гениальность' 'имеет' 'свои' 'пределы. \
	Несколько' 'безобидных' 'хлопьев,' 'работающих' 'вместе,' 'могут' 'развязать' 'лавину' 'разрушения. \
	Проживай' 'каждый' 'день' 'так,' 'будто' 'он' 'у' 'тебя' 'предпоследний.' 'Так' 'ты' 'сможешь' 'засыпать' 'по' 'ночам. \
	Измени' 'свой' 'взгляд' 'на' 'вещи,' 'и' 'вещи,' 'на' 'которые' 'ты' 'смотришь,' 'изменятся. \
	Свет' 'в' 'конце' 'тоннеля' 'выключили' 'из-за' 'сокращения' 'бюджета. \
	Никогда' 'не' 'ложись' 'спать' 'сумасшедшим.' 'Не' 'спи' 'и' 'борись. \
	Просвещает' 'не' 'ответ,' 'а' 'вопрос. \
	Лучший' 'способ' 'поднять' 'настроение' 'себе' '-' 'это' 'попытаться' 'поднять' 'настроение' 'кому-то' 'другому. \
	Человек,' 'который' 'сдвигает' 'гору,' 'начинает' 'с' 'того,' 'что' 'уносит' 'маленькие' 'камни. \
	Я' 'не' 'могу' 'позволить' 'себе' 'тратить' 'время' 'на' 'зарабатывание' 'денег. \
	Только' 'тот,' 'кто' 'пробует' 'абсурдное,' 'способен' 'достичь' 'невозможного. \
	Вопрос' 'не' 'в' 'том,' 'кто' 'мне' 'позволит,' 'а' 'в' 'том,' 'кто' 'меня' 'остановит. \
	Ошибки' 'совершать' 'не' 'страшно.' 'Главное' 'каждый' 'раз' 'ошибаться' 'в' 'чём-то' 'новом. \
	Мы' 'должны' 'понять,' 'как' 'нам' 'получить' 'то,' 'что' 'мы' 'любим,' 'и' 'при' 'этом' 'не' 'уничтожить' 'мир. \
	Если' 'вернуться' 'на' 'несколько' 'сотен' 'лет' 'назад,' 'все,' 'что' 'мы' 'сегодня' 'считаем' 'обычными' 'вещами,' 'покажется' 'магией' '—' 'разговоры' 'на' 'расстоянии,' 'передача' 'изображений,' 'полеты,' 'пророчества,' 'основанные' 'на' 'обработке' 'огромных' 'объемов' 'информации.' 'Несколько' 'сот' 'лет' 'назад' 'это' 'выглядело' 'бы' 'как' 'волшебство. \
	У' 'меня' 'есть' 'собственное' 'кладбище' 'неудачных' 'попыток.' 'Там' 'стоит' 'множество' 'надгробий,' 'а' 'где-то' 'в' 'глубине' 'полно' 'свежевырытых' 'могил,' 'которые' 'ждут,' 'когда' 'в' 'них' 'что-то' 'окажется.' 'Но' 'я' 'делаю' 'все' 'для' 'того,' 'чтобы' 'они' 'оставались' 'пустыми. \
	Когда' 'Генри' 'Форд' 'создал' 'дешёвые' 'и' 'надёжные' 'автомобили,' 'люди' 'сказали:' ''"'Нет,' 'спасибо.' 'Чем' 'плохи' 'лошади?'"'' 'Он' 'рискнул' 'всем,' 'и' 'это' 'сработало. \
	Если' 'человек' 'считает,' 'что' 'предпочел' 'бы' 'жить' 'в' 'другую' 'эпоху,' 'весьма' 'вероятно,' 'он' 'просто' 'плохо' 'учил' 'историю.' 'В' 'прошлом' 'жизнь' 'была' 'полным' 'отстоем.' 'Люди' 'очень' 'мало' 'знали' 'и' 'имели' 'много' 'шансов' 'умереть' 'в' 'молодости' 'от' 'какой-нибудь' 'ужасной' 'болезни.' 'Возможно,' 'в' 'вашем' 'возрасте' 'у' 'вас' 'уже' 'выпали' 'бы' 'все' 'зубы.' 'Для' 'женщины' 'это' 'была' 'бы' 'совсем' 'ужасная' 'ситуация. \
	Не' 'стоит' 'утверждать,' 'что' 'терпеть' 'поражение' '—' 'нормально.' 'Иное' 'дело' '—' 'если' 'пробовать' 'новое,' 'одну' 'идею,' 'другую,' 'то' 'многие' 'варианты' 'могут' 'не' 'сработать.' 'Вот' 'это' 'должно' 'считаться' 'нормальным.' 'А' 'если' 'вы' 'думаете,' 'что' 'каждая' 'высказанная' 'идея' 'должна' 'быть' 'успешной,' 'то' 'не' 'добьетесь' 'никаких' 'успехов. \
	Многие' 'не' 'любят' 'перемен,' 'но' 'мы' 'должны' 'научиться' 'принимать' 'их.' 'Особенно' 'если' 'альтернатива' 'переменам' '—' 'это' 'катастрофа. \
	Очень' 'важно' 'активно' 'просить' 'об' 'отрицательных' 'отзывах' 'и' 'с' 'особым' 'вниманием' 'прислушиваться' 'к' 'ним.' 'Обычно' 'люди' 'их' 'избегают,' 'чтобы' 'не' 'переживать' 'неприятных' 'эмоций.' 'Но' 'я' 'считаю' 'это' 'крайне' 'распространенной' 'ошибкой' '—' 'не' 'просить' 'об' 'отрицательных' 'отзывах' 'и' 'не' 'учитывать' 'их. \
	Искусственный' 'интеллект' '—' 'фундаментальная' 'угроза' 'для' 'всего' 'человечества. \
	Неудача' '–' 'это' 'отличный' 'шанс.' 'Если' 'вы' 'не' 'будете' 'сталкиваться' 'с' 'неудачами,' 'вы' 'не' 'сможете' 'изобретать' 'новое. \
	Я' 'бы' 'хотел' 'умереть' 'на' 'Марсе' '—' 'но' 'только' 'не' 'от' 'удара' 'о' 'поверхность. \
	Создать' 'хорошую' 'компанию' '—' 'как' 'испечь' 'хороший' 'пирог:' 'нужно' 'просто' 'взять' 'правильные' 'ингредиенты' 'в' 'правильных' 'пропорциях. \
	Всех,' 'даже' 'самых' 'злобных' 'и' 'отвратительных' 'диктаторов,' 'объединяло' 'одно' '–' 'они' 'были' 'смертными.' 'Однако' 'для' 'искусственного' 'интеллекта' 'вообще' 'не' 'будет' 'существовать' 'такого' 'понятия,' 'как' 'смерть.' 'Он' 'сможет' 'существовать' 'вечно.' 'От' 'такого' 'зла' 'людям' 'некуда' 'будет' 'спрятаться. \
	Если' 'у' 'тебя' 'есть' 'миллионы' 'долларов,' 'это' 'меняет' 'твой' 'образ' 'жизни' '–' 'те,' 'кто' 'говорит' 'иначе,' 'нагло' 'врут.' 'Мне' 'не' 'нужно' 'работать' 'с' 'точки' 'зрения' 'стандартной' 'жизни,' 'но,' 'знаете,' 'я' 'работаю.' 'Я' 'работаю' 'каждый' 'день' 'и' 'на' 'выходных,' 'и' 'я' 'несколько' 'лет' 'не' 'был' 'в' 'отпуске. \
	Я' 'считаю,' 'что' 'очень' 'важно' 'получать' 'от' 'самого' 'себя' 'обратную' 'связь:' 'постоянно' 'думать' 'о' 'том,' 'что' 'вы' 'делаете,' 'и' 'как' 'можно' 'сделать' 'это' 'лучше.' 'Я' 'считаю,' 'что' 'это' 'лучший' 'совет:' 'всегда' 'думайте,' 'как' 'вы' 'можете' 'поступать' 'еще' 'лучше,' 'и' 'проверяйте' 'себя. \
	Я' 'тошнотворно' 'проамериканский.' 'Это' 'место,' 'где' 'великие' 'свершения' 'становятся' 'возможными. \
	Сейчас' 'у' 'вас' 'больше' 'власти,' 'чем' 'было' 'у' 'президента' 'США' 'двадцать' 'лет' 'назад.' 'Я' 'могу' 'дать' 'ответ' 'на' 'любой' 'вопрос,' 'могу' 'связаться' 'по' 'видеосвязи' 'с' 'любым' 'человеком' 'из' 'любой' 'точки' 'мира.' 'Вы' 'можете' 'мгновенно' 'отправлять' 'сообщения' 'миллионам' 'людей.' 'То' 'есть' 'делать' 'невероятные' 'вещи. \
	Я' 'хочу' 'быть' 'частью' 'того,' 'что' 'меняет' 'мир. \
	Просто' 'прими' 'за' 'данность,' 'что' 'ты' '—' 'неправ' 'и' 'твоя' 'цель' '—' 'ошибаться' 'меньше.' 'Не' 'думаю,' 'что' 'у' 'тебя' 'каждый' 'день' 'получится' 'быть' 'менее' 'неправым,' 'но' 'если' 'ты' 'сможешь' 'меньше' 'ошибаться,' 'то' 'у' 'тебя' 'здорово' 'получается! \
	Право' 'на' 'ношение' 'оружия' 'является' 'важной' 'гарантией' 'от' 'потенциальной' 'тирании' 'правительства. \
	Неудача' '—' 'это' 'средство' 'достижения. \
	Ты' 'должен' 'кое-что' 'запомнить:' 'все' 'жалеют' 'слабых'; 'ревность' 'ты' 'должен' 'заслужить. \
	Сила' 'не' 'приходит' 'от' 'победы.' 'Ваша' 'борьба' 'развивает' 'ваши' 'сильные' 'стороны.' 'Когда' 'вы' 'проходите' 'через' 'трудности' 'и' 'решаете' 'не' 'сдаваться,' 'это' 'и' 'есть' 'сила. \
	Какой' 'смысл' 'жить' 'на' 'этой' 'земле,' 'если' 'ты' 'собираешься' 'стать' 'таким' 'же,' 'как' 'все? \
	Как' 'и' 'в' 'бодибилдинге,' 'неудача' 'также' 'является' 'необходимым' 'опытом' 'для' 'роста' 'в' 'нашей' 'собственной' 'жизни,' 'потому' 'что' 'если' 'мы' 'никогда' 'не' 'испытываем' 'наши' 'пределы,' 'как' 'мы' 'узнаем,' 'насколько' 'мы' 'действительно' 'сильны?' 'Как' 'мы' 'вообще' 'будем' 'расти? \
	Для' 'меня' 'жизнь-это' 'постоянное' 'чувство' 'голода.' 'Смысл' 'жизни' 'не' 'в' 'том,' 'чтобы' 'просто' 'существовать,' 'выживать,' 'а' 'в' 'том,' 'чтобы' 'двигаться' 'вперед,' 'идти' 'вверх,' 'достигать,' 'побеждать. \
	Разум' '-' 'это' 'предел.' 'Пока' 'ум' 'может' 'представить' 'себе' 'тот' 'факт,' 'что' 'вы' 'можете' 'что-то' 'сделать,' 'вы' 'можете' 'это' 'сделать,' 'пока' 'вы' 'действительно' 'верите' 'на' '100' 'процентов. \
	Последние' 'три-четыре' 'повторения-это' 'то,' 'что' 'заставляет' 'мышцы' 'расти.' 'Эта' 'область' 'боли' 'отделяет' 'чемпиона' 'от' 'кого-то' 'другого,' 'кто' 'не' 'является' 'чемпионом.' 'Это' 'то,' 'чего' 'не' 'хватает' 'большинству' 'людей' '-' 'иметь' 'мужество' 'продолжать' 'и' 'просто' 'сказать,' 'что' 'они' 'пройдут' 'через' 'боль,' 'что' 'бы' 'ни' 'случилось. \
	Если' 'вы' 'не' 'найдете' 'времени,' 'если' 'вы' 'не' 'сделаете' 'работу,' 'вы' 'не' 'получите' 'результатов. \
	Чем' 'лучше' 'ты' 'становишься,' 'тем' 'меньше' 'бегаешь' 'вокруг,' 'выставляя' 'себя' 'мускулистым' 'парнем.' 'Знаешь,' 'ты' 'носишь' 'обычные' 'рубашки-не' 'всегда' 'стараясь' 'показать' 'то,' 'что' 'у' 'тебя' 'есть.' 'Ты' 'меньше' 'об' 'этом' 'говоришь.' 'Это' 'как' 'если' 'бы' 'у' 'вас' 'был' 'маленький' 'BMW' '–' 'вы' 'хотите' 'мчаться' 'к' 'черту' 'из' 'этой' 'машины,' 'потому' 'что' 'вы' 'знаете,' 'что' 'она' 'просто' 'едет' '110.' 'Но' 'если' 'вы' 'видите' 'парней' 'за' 'рулем' 'ferrari' 'или' 'lamborghini,' 'они' 'скользят' 'по' 'шоссе' 'со' 'скоростью' '60,' 'потому' 'что' 'знают,' 'что' 'если' 'они' 'нажмут' 'на' 'акселератор,' 'то' 'поедут' 'на' '170.' 'Эти' 'вещи' 'одинаковы' 'во' 'всех' 'областях. \
	Позитивное' 'мышление' 'может' 'быть' 'заразным.' 'Быть' 'окруженным' 'победителями' 'помогает' 'вам' 'развиться' 'в' 'победителя. \
	Важно' 'не' 'то,' 'что' 'ты' 'получаешь' 'от' 'жизни.' 'Разбейте' 'ваши' 'зеркала!' 'В' 'нашем' 'обществе,' 'которое' 'так' 'поглощено' 'собой,' 'начинают' 'меньше' 'смотреть' 'на' 'себя' 'и' 'больше' 'друг' 'на' 'друга.' 'Вы' 'получите' 'больше' 'удовольствия' 'от' 'улучшения' 'вашего' 'района,' 'вашего' 'города,' 'вашего' 'штата,' 'вашей' 'страны' 'и' 'ваших' 'собратьев,' 'чем' 'когда-либо' 'получите' 'от' 'ваших' 'мышц,' 'вашей' 'фигуры,' 'вашего' 'автомобиля,' 'вашего' 'дома' 'или' 'вашего' 'кредитного' 'рейтинга. \
	Если' 'вы' 'хотите' 'превратить' 'свое' 'видение' 'в' 'реальность,' 'вы' 'должны' 'выложиться' 'на' 'все' '100%' 'и' 'никогда' 'не' 'переставать' 'верить' 'в' 'свою' 'мечту. \
	Будьте' 'жаждущими' 'успеха,' 'жаждущими' 'оставить' 'свой' 'след,' 'жаждущими' 'быть' 'увиденными,' 'услышанными' 'и' 'произвести' 'эффект.' 'И' 'по' 'мере' 'того,' 'как' 'вы' 'продвигаетесь' 'вверх' 'и' 'добиваетесь' 'успеха,' 'убедитесь,' 'что' 'вы' 'также' 'жаждете' 'помогать' 'другим. \
	Чем' 'больше' 'у' 'тебя' 'знаний,' 'тем' 'больше' 'ты' 'можешь' 'полагаться' 'на' 'свои' 'инстинкты. \
	Я' 'делаю' 'те' 'же' 'упражнения,' 'что' 'и' '50' 'лет' 'назад,' 'и' 'они' 'все' 'еще' 'работают.' 'Я' 'ем' 'ту' 'же' 'пищу,' 'что' 'и' '50' 'лет' 'назад,' 'и' 'она' 'все' 'еще' 'работает. \
	Неудача' '-' 'это' 'не' 'вариант.' 'Каждый' 'должен' 'добиться' 'успеха. \
	Если' 'это' 'трудно' 'запомнить,' 'то' 'и' 'забыть' 'будет' 'трудно. \
	Шесть' 'жизненных' 'правил' 'успеха.' '1.' 'Доверять' 'себе.' '2.' 'Нарушить' 'некоторые' 'правила.' '3.' 'Не' 'бойтесь' 'потерпеть' 'неудачу.' '4.' 'Не' 'обращайте' 'внимания' 'на' 'скептиков.' '5.' 'Работай' 'как' 'проклятый.' '6.' 'Дай' 'мне' 'что-нибудь' 'взамен. \
	Вы' 'не' 'можете' 'подняться' 'по' 'лестнице' 'успеха,' 'держа' 'руки' 'в' 'карманах. \
	Я' 'не' 'отказываюсь' 'от' 'того,' 'что' 'считаю' 'незаконченным. \
	Жизнь' 'может' 'быть' 'полна' 'боли,' 'но' 'это' 'не' 'повод' 'сдаваться. \
	Я' 'бы' 'никогда' 'не' 'променял' 'свою' 'жизнь' 'ни' 'на' 'чью' 'другую. \
	Выученная' 'беспомощность' '-' 'это' 'реакция' 'отказа,' 'уходящая' 'реакция,' 'которая' 'вытекает' 'из' 'убеждения,' 'что' 'все,' 'что' 'вы' 'делаете,' 'не' 'имеет' 'значения. \
	Деньги' 'не' 'делают' 'тебя' 'счастливым.' 'Сейчас' 'у' 'меня' 'есть' '50' 'миллионов' 'долларов,' 'но' 'я' 'был' 'так' 'же' 'счастлив,' 'когда' 'у' 'меня' 'было' '48' 'миллионов. \
	Половина' 'того,' 'что' 'отделяет' 'успешных' 'предпринимателей' 'от' 'неудачников' '—' 'это' 'настойчивость. \
	Если' 'ты' 'хочешь' 'идти' 'новым' 'путем,' 'ты' 'должен' 'проложить' 'его' 'сам. \
	Давайте' 'лучше' 'изобретать' 'будущее,' 'а' 'не' 'беспокоиться' 'о' 'вчера. \
	По' 'учению' 'буддистов,' 'мнение' 'новичка' 'очень' 'ценно' '—' 'сохранить' 'его' 'в' 'себе' 'неизменным' 'практически' 'невозможно' 'и' 'почти' 'недостижимо.' 'Хотя' 'чудеса' 'случаются. \
	Ваше' 'время' 'ограничено,' 'поэтому' 'не' 'тратьте' 'его' 'на' 'жизнь' 'чьей-то' 'чужой' 'жизнью.' 'Не' 'попадайте' 'в' 'ловушку' 'догмы,' 'которая' 'говорит' 'жить' 'мыслями' 'других' 'людей.' 'Не' 'позволяйте' 'шуму' 'чужих' 'мнений' 'перебить' 'ваш' 'внутренний' 'голос.' 'И' 'самое' 'главное' '—' 'имейте' 'храбрость' 'следовать' 'своему' 'сердцу' 'и' 'интуиции.' 'Они' 'каким-то' 'образом' 'уже' 'знают' 'то,' 'кем' 'вы' 'хотите' 'стать' 'на' 'самом' 'деле.' 'Все' 'остальное' 'вторично. \
	Да' 'вы' 'можете' 'это' 'сделать!' 'Привыкните' 'к' 'этой' 'мысли. \
	Если' 'ты' 'сам' 'рубишь' 'дрова,' 'то' 'согреваешься' 'ими' 'дважды. \
	Когда' 'мне' 'не' 'хватало' 'денег,' 'я' 'садился' 'думать,' 'а' 'не' 'бежал' 'зарабатывать.' 'Идея' '—' 'самый' 'дорогой' 'товар' 'на' 'свете. \
	Наиболее' 'важные' 'решения' '—' 'это' 'не' 'то,' 'что' 'вы' 'делаете,' 'а' 'то,' 'что' 'вы' 'решили' 'не' 'делать. \
	Если' 'ты' 'еще' 'не' 'нашел' 'того,' 'что' 'искал,' 'продолжай' 'поиски.' 'Не' 'останавливайся.' 'Поскольку' 'это' 'касается' 'сути' 'вещей.' 'Ты' 'не' 'пропустишь' 'момента,' 'когда' 'действительно' 'найдешь' 'это. \
	Лучше' 'находиться' 'в' 'обществе' 'людей' 'лучших,' 'чем' 'вы' 'сами…' 'Выберите' 'знакомых,' 'чье' 'поведение' 'лучше,' 'чем' 'ваше,' 'и' 'вы' 'устремитесь' 'в' 'этом' 'направлении. \
	Даже' 'если' 'вы' 'очень' 'талантливы' 'и' 'прилагаете' 'большие' 'усилия,' 'для' 'некоторых' 'результатов' 'просто' 'требуется' 'время.\
	Делайте' 'дела' 'с' 'теми' 'людьми,' 'которые' 'вам' 'нравятся' 'и' 'которые' 'разделяют' 'ваши' 'цели. \
	Понимание' 'того,' 'на' 'что' 'не' 'стоит' 'обращать' 'внимания,' 'столь' 'же' 'важно,' 'как' 'понимание' 'того,' 'на' 'чем' 'следует' 'сфокусироваться. \
	Постоянно' 'откладывать' 'поиски' 'хорошей' 'работы' 'и' 'просиживать' 'на' 'той,' 'что' 'тебя' 'убивает,' '—' 'это' 'как' 'откладывать' 'секс' 'до' 'пенсии. \
	Никогда' 'не' 'попадайте' 'в' 'зависимость' 'от' 'единственного' 'источника' 'дохода.' 'Инвестируйте,' 'чтобы' 'создать' 'второй' 'источник. \
	Я' 'не' 'ищу' 'высокие' 'перекладины,' 'чтобы' 'прыгать' 'через' 'них'; 'я' 'ищу' 'те,' 'через' 'которые' 'смогу' 'перешагнуть. \
	Если' 'у' 'вас' 'есть' 'возможность' 'выбора,' 'гораздо' 'важнее' 'сказать' «'нет»,' 'чем' «'да'»'. \
	Ищите' 'в' 'человеке' 'три' 'черты:' 'интеллект,' 'энергию' 'и' 'честность.' 'Если' 'у' 'него' 'нет' 'последней' 'черты,' 'даже' 'не' 'беспокойтесь' 'о' 'двух' 'других. \
	Не' 'соглашайтесь' 'ни' 'на' 'что' 'кроме' 'своей' 'страсти,' 'если' 'вам' 'повезет' 'найти' 'ее. \
	Будущее' 'принадлежит' 'тем,' 'кто' 'верит' 'в' 'красоту' 'мечты. \
	Каждый' 'день' 'делай' 'одну' 'вещь,' 'которая' 'пугает' 'тебя. \
	Делай' 'то,' 'что' 'тебе' 'хочется.' 'Потому' 'что' 'тебя' 'в' 'любом' 'случае' 'будут' 'критиковать.' 'Тебя' 'будут' 'ругать,' 'если' 'ты' 'сделал' 'это,' 'и' 'будут' 'ругать,' 'если' 'ты' 'этого' 'не' 'сделал. \
	Лучше' 'зажечь' 'свечу,' 'чем' 'проклинать' 'тьму. \
	Не' 'переставай' 'думать' 'о' 'жизни,' 'как' 'о' 'приключении. \
	Силу,' 'смелость' 'и' 'уверенность' 'приобретают' 'тогда,' 'когда' 'смотрят' 'страху' 'прямо' 'в' 'глаза.' 'Надо' 'делать' 'то,' 'чего,' 'казалось' 'бы,' 'вы' 'сделать' 'не' 'сможете. \
	С' 'новым' 'днем' 'приходят' 'новые' 'силы' 'и' 'мысли. \
	Я' 'готова' 'была' 'дать' 'объяснения,' 'но' 'никогда' 'не' 'приносила' 'извинений,' 'если' 'делала' 'то,' 'что' 'считала' 'правильным. \
	Вы' 'должны' 'делать' 'то,' 'что,' 'как' 'вам' 'кажется,' 'вы' 'сделать' 'не' 'в' 'состоянии. \
	Цель' 'жизни' 'состоит' 'в' 'том,' 'чтобы' 'прожить' 'ее,' 'испытать' 'опыт' 'в' 'максимальной' 'степени,' 'стремиться' 'протянуть' 'руку' 'и' 'без' 'страха' 'перед' 'новым' 'и' 'более' 'богатым' 'опытом. \
	Праздновать' 'успех' '—' 'это' 'нормально,' 'но' 'важнее' 'усвоить' 'уроки' 'неудач. \
	Мы' 'всегда' 'переоцениваем' 'изменения,' 'которые' 'произойдут' 'в' 'следующие' 'два' 'года,' 'и' 'недооцениваем' 'изменения,' 'которые' 'произойдут' 'в' 'следующие' \ 'десять.' 'Не' 'позволяйте' 'убаюкивать' 'себя' 'бездействием. \
	Если' 'вы' 'не' 'можете' 'сделать' 'что-то' 'хорошо,' 'по' 'крайней' 'мере,' 'сделайте' 'так,' 'чтобы' 'оно' 'хорошо' 'выглядело. \
	В' 'офисе,' 'дома' 'или' 'в' 'дороге' 'у' 'меня' 'всегда' 'есть' 'стопка' 'книг,' 'читать' 'которые' 'я' 'жду' 'с' 'нетерпением. \
	Нам' 'всем' 'нужны' 'люди,' 'которые' 'дают' 'нам' 'обратную' 'связь.' 'Так' 'мы' 'становимся' 'лучше. \
	Терпение' '—' 'ключевой' 'секрет' 'успеха. \
	Не' 'сравнивайте' 'себя' 'ни' 'с' 'кем' 'в' 'этом' 'мире...' 'если' 'вы' 'так' 'поступаете,' 'вы' 'оскорбляете' 'себя. \
	Я' 'ни' 'с' 'кем' 'не' 'соревнуюсь,' 'кроме' 'себя. \
	Моя' 'цель' '—' 'постоянно' 'совершенствоваться. \
	Чтобы' 'выиграть' 'по-крупному,' 'иногда' 'приходится' 'сильно' 'рисковать. \
	Кто' 'никогда' 'не' 'совершал' 'ошибок,' 'тот' 'никогда' 'не' 'пробовал' 'что-то' 'новое. \
	Ты' 'никогда' 'не' 'решишь' 'проблему,' 'если' 'будешь' 'думать' 'так' 'же,' 'как' 'те,' 'кто' 'ее' 'создал. \
	Лучше' 'верить,' 'чем' 'не' 'верить,' 'потому' 'что' 'с' 'верой' 'всё' 'становится' 'возможным. \
	Я' 'благодарен' 'всем' 'тем,' 'кто' 'сказал' 'мне' «'Нет'»'.' 'Благодаря' 'им' 'я' 'чего-то' 'добился' 'сам. \
	Бессмысленно' 'продолжить' 'делать' 'то' 'же' 'самое' 'и' 'ждать' 'других' 'результатов. \
	Человек' 'начинает' 'жить' 'лишь' 'тогда,' 'когда' 'ему' 'удается' 'превзойти' 'себя. \
	Стремись' 'не' 'к' 'тому,' 'чтобы' 'добиться' 'успеха,' 'а' 'к' 'тому,' 'чтобы' 'твоя' 'жизнь' 'имела' 'смысл. \
	Если' 'вы' 'хотите' 'вести' 'счастливую' 'жизнь,' 'вы' 'должны' 'быть' 'привязаны' 'к' 'цели,' 'а' 'не' 'к' 'людям' 'или' 'к' 'вещам. \
	Благоприятный' 'шанс' 'кроется' 'среди' 'трудностей. \
	Есть' 'только' 'два' 'способа' 'прожить' 'свою' 'жизнь.' 'Первый' '—' 'так,' 'будто' 'никаких' 'чудес' 'не' 'бывает.' 'Второй' '—' 'так,' 'будто' 'все' 'на' 'свете' 'является' 'чудом. \
	Если' 'вы' 'не' 'хотите' 'слышать' 'критику,' 'пожалуйста,' 'не' 'делайте' 'ничего' 'нового. \
	Провал' '—' 'часть' 'попытки' 'изобрести' 'что-либо.' 'Две' 'эти' 'вещи' 'не' 'могут' 'идти' 'отдельно' 'друг' 'от' 'друга. \
	Будьте' 'упорны' 'в' 'проницательности,' 'но' 'гибки' 'в' 'деталях. \
	Если' 'вы' 'предпринимаете' 'только' 'те' 'действия,' 'результат' 'которых' 'известен' 'вам' 'заранее,' 'долго' 'ваш' 'бизнес' 'не' 'протянет. \
	Я' 'знаю,' 'что' 'если' 'потерплю' 'неудачу,' 'то' 'не' 'буду' 'об' 'этом' 'жалеть.' 'Единственное,' 'о' 'чем' 'стоить' 'сожалеть,' 'это' 'о' 'том,' 'что' 'даже' 'не' 'попробовал. \
	В' 'конце' 'нашей' 'жизни' 'мы' 'будем' 'только' 'результатом' 'выбора,' 'который' 'делали' 'на' 'протяжении' 'всей' 'жизни. \
	Сведите' 'к' 'минимуму' 'сожаление. \
	Всегда' 'пытайтесь. \
	Жизнь' 'слишком' 'коротка,' 'чтобы' 'быть' 'с' 'людьми,' 'у' 'которых' 'нет' 'ресурсов. \
	Один' 'из' 'немногих' 'способов' 'выбраться' 'из' 'тесноты' '—' 'придумать' 'свой' 'собственный' 'путь. \
	Богатство' 'не' 'в' 'накоплении,' 'а' 'в' 'умении' 'выбрать' 'лучшее. \
	Не' 'позволяйте' 'никому' 'стоять' 'на' 'вашем' 'пути. \
	Богатство' '—' 'это' 'результат' 'умения' 'человека' 'мыслить.' 'Сами' 'по' 'себе' 'деньги' '—' 'лишь' 'средство. \
	Уходите' 'без' 'оглядки' 'от' 'любого,' 'кто' 'скажет' 'вам,' 'что' 'деньги' '—' 'зло.' 'Эти' 'слова' '—' 'колокольчик' 'прокаженного,' 'лязг' 'оружия' 'бандита. \
	Нет' 'ничего' 'важнее,' 'чем' 'то,' 'как' 'ты' 'делаешь' 'свою' 'работу.' 'Ничего' 'нет.' 'Это' 'самое' 'главное.' 'И' 'твоя' 'сущность' 'проявляется' 'именно' 'в' 'этом.' 'Такова' 'единственная' 'мера' 'ценности' 'человека. \
	Не' 'пренебрегайте' 'своими' 'желаниями.' 'Не' 'жертвуйте' 'ими.' 'Исследуйте' 'их' 'причину. \
	Толпа' 'может' 'простить' 'что' 'угодно' 'и' 'кого' 'угодно,' 'только' 'не' 'человека,' 'способного' 'оставаться' 'самим' 'собой' 'под' 'напором' 'ее' 'презрительных' 'насмешек. \
	Если' 'ты' 'собираешься' 'держать' 'свое' 'слово,' 'не' 'надо' 'говорить' 'об' 'этом,' 'просто' 'держи' 'его. \
	Если' 'вы' 'попытаетесь' 'с' 'помощью' 'денег' 'окружить' 'себя' 'теми,' 'кто' 'выше' 'и' 'умнее' 'вас,' 'чтобы' 'обрести' 'престиж,' 'то' 'в' 'конце' 'концов' 'падете' 'жертвой' 'тех,' 'кто' 'ниже. \
	У' 'каждого' 'человека' 'есть' 'руки,' 'ноги,' 'голова' 'и' '168' 'часов' 'в' 'неделю,' 'чтобы' 'сделать' 'все' 'то,' 'что' 'он' 'по-настоящему' 'желает. \
	Оправдания' 'делают' 'человека' 'бедным. \
	Видеть' 'то,' 'чего' 'не' 'замечают' 'другие,' '—' '' 'универсальный' 'ключ' 'к' 'успеху. \
	Не' 'бойтесь' 'проигрывать.' 'Победители' 'не' 'боятся' 'проигрывать.' 'Поражение' '—' 'это' 'часть' 'дороги' 'к' 'успеху.' 'Люди,' 'избегающие' 'неудач' '—' 'избегают' 'и' 'успехов. \
	Мы' '—' 'рабы' 'своих' 'привычек.' 'Измени' 'свои' 'привычки,' 'и' 'изменится' 'твоя' 'жизнь... \
	Люди' 'потому' 'и' 'проигрывают,' 'что' 'слишком' 'боятся' 'проигрывать. \
	Наши' 'эмоции' '—' 'мощная' 'сила.' 'Если' 'их' 'не' 'контролировать,' 'они' 'становятся' 'самореализующимися' 'пророчествами. \
	Если' 'ты' 'знаешь,' 'что' 'ты' 'прав,' '—' 'ты' 'не' 'боишься' 'дать' 'отпор. \
	Когда' 'я' 'вижу,' 'что' 'люди' 'не' 'улыбаются' 'мне,' 'я' 'просто' 'начинаю' 'улыбаться' 'и' 'говорить' 'им' «'привет'» 'и' 'как' 'по' 'волшебству,' 'вокруг' 'меня' 'появляется' 'больше' 'улыбающихся' 'людей.' 'Получается' 'так,' 'что' 'мир,' 'как' 'зеркало' 'отображает' 'вас. \
	Ваше' 'будущее' 'создается' 'тем,' 'что' 'вы' 'делаете' 'сегодня,' 'а' 'не' 'тем,' 'что' 'будете' 'делать' 'завтра. \
	Почему' 'я' 'владею' 'биткоинами.' 'Биткоин' '—' 'это' 'защита' 'от' 'кражи' 'нашего' 'богатства' 'через' 'нашу' 'валюту.' 'Вот' 'почему' 'я' 'сохраняю' 'и' 'инвестирую' 'в' 'биткоины,' 'а' 'не' 'в' 'акции,' 'облигации' 'и' 'фальшивые' 'доллары. \
	Миллионы' 'людей' 'очень' 'счастливы,' 'что' 'правительство' 'приняло' 'пакет' 'стимулирующих' 'мер' 'на' '1,9' 'трлн. долларов' 'Кто' 'ж' 'не' 'будет' 'счастлив' 'получить' "'деньги'" 'даром.' 'Проблема' 'в' 'том,' 'что' 'такие' 'деньги' 'делают' 'бедных' 'и' 'средний' 'класс' 'беднее.' 'Покупайте' 'больше' 'золота,' 'серебра' 'и' 'биткоина. \
	Прошлое' 'бывает' 'слишком' 'тяжелым' 'для' 'того,' 'чтобы' 'повсюду' 'носить' 'его' 'с' 'собой.' 'Иногда' 'о' 'нем' 'стоит' 'забыть' 'ради' 'будущего. \
	Наш' 'выбор' 'в' 'большей' 'мере,' 'чем' 'наши' 'способности,' 'показывает' 'нашу' 'истинную' 'сущность. \
	Важно' 'помнить,' 'что' 'в' 'каждом' 'из' 'нас' 'есть' 'магия. \
	Чтобы' 'научиться' 'писать,' 'надо' 'много' 'читать' '—' 'только' 'это' 'и' 'помогает. \
	Вы' 'никогда' 'не' 'познаете' 'себя,' 'прочность' 'ваших' 'отношений,' 'пока' 'не' 'переживете' 'черную' 'полосу.' 'Этот' 'опыт' '—' 'настоящий' 'подарок. \
	Когда' 'твоя' 'лопата' 'начинает' 'плавиться' 'от' 'палящего' 'жара' 'земного' 'ядра,' 'прекращай' 'рыть. \
	Невозможно' 'жить' 'без' 'сбоев,' 'если' 'только' 'вы' 'не' 'живете' 'так' 'осторожно,' 'что' 'не' 'живете' 'вообще' '—' 'в' 'этом' 'случае' 'вы' 'терпите' 'неудачу' 'по' 'умолчанию. \
	Никогда' 'не' 'жди,' 'пока' 'достигнешь' 'совершенства,' 'иначе' 'будешь' 'ждать' 'вечно.' 'Делай' 'лучшее' 'из' 'того,' 'что' 'ты' 'можешь,' 'с' 'тем,' 'что' 'имеешь.' 'И' 'будь' 'одним' 'из' 'тех,' 'кто' 'осмелился,' 'а' 'не' 'тем,' 'кто' 'только' 'мечтал. \
	Не' 'позволяй' 'их' 'смеху' 'погасить' 'твои' 'амбиции.' 'Преврати' 'его' 'в' 'топливо! \
	Все' 'возможно,' 'если' 'у' 'вас' 'достаточно' 'храбрости! \
	Перестаньте' 'бороться' 'с' 'испытаниями.' 'Лучше' 'найдите' 'новый' 'способ' 'подняться. \
	Мир' 'недооценивает' 'тех,' 'кто' 'сам' 'недооценивает' 'свою' 'деятельность. \
	Вы' 'получаете' 'ровно' 'то,' 'что' 'осмеливаетесь' 'просить' 'у' 'жизни. \
	Никогда' 'не' 'сосредотачивайте' 'внимание' 'на' 'том,' 'чего' 'не' 'имеете.' 'Иначе' 'вам' 'всегда' 'будет' 'мало. \
	Удача' '—' 'это' 'не' 'череда' 'случайностей,' 'а' 'умение' 'использовать' 'случай,' 'который' 'предоставляет' 'жизнь. \
	Самые' 'большие' 'ошибки' 'мы' 'совершаем' 'именно' 'тогда,' 'когда' 'пытаемся' 'угодить' 'окружающим. \
	Позитивные' 'эмоции' 'вызывают' 'ответную' 'реакцию' 'мира.' 'Когда' 'вы' 'фокусируетесь' 'на' 'чем-то' 'добром,' 'теплом,' 'хорошем,' 'то' 'жизнь' 'приобретает' 'такие' 'же' 'краски. \
	Преврати' 'свои' 'раны' 'в' 'мудрость. \
	Лучшее' 'приключение,' 'которое' 'может' 'случиться' 'с' 'человеком,' 'это' 'жить' 'жизнью' 'своей' 'мечты. \
	Не' 'зацикливайся' 'на' 'том,' 'кем' 'ты' 'был.' 'Не' 'ограничивай' 'себя' 'тем,' 'что' 'умеешь' 'и' 'имеешь' 'сейчас. \
	Плохие' 'новости': 'крах' 'уже' 'начался.' 'Он' 'будет' 'тяжелым.' 'Хорошие' 'новости': 'крахи' '—' 'лучшее' 'время,' 'чтобы' 'разбогатеть. \
	Не' 'копите' 'фейковые' 'деньги' '\(доллар' 'США,' 'евро,' 'иену,' 'песо\),' 'которые' 'падают' 'в' 'цене.' 'Копите' 'золото,' 'серебро' 'и' 'биткоин' '—' 'настоящие' 'деньги,' 'ценность' 'которых' 'растет,' 'особенно' 'в' 'условиях' 'краха' 'рынка.

YELLOW='\033[1;33m'
PURPLE='\033[1;35m'
q=''
a=''

motivation:
	@rand=$(shell awk 'BEGIN{srand();printf("%d", 431*rand())}')
	@rand=$$(( $$rand + 1))
	@for quote in $(QUOTES); do \
		i=$$((i+1)); \
		if [ $$rand -eq $$i ]; then \
			q=$$quote; break; \
		fi
	done
	i=0
	@for author in $(AUTHORS); do \
		i=$$((i+1)); \
		if [ $$rand -eq $$i ]; then \
			a=$$author; break; \
		fi
	done
	echo ${YELLOW}$$q; \
	echo ${PURPLE}'	'$$a; \


